{"pageProps":{"post":{"title":"Job Tips for juniors","date":"2013-10-08","content":"\nWe've been looking for new interns here at tapadoo in recent weeks. We've also interviewed for graduate positions. But there's one quote we've heard a number of times which frankly left me surprised.\n\n> Oh, we didn't cover that in college\n\nThis is astonishing. College isn't there to teach you every keyword in the whatever language. They teach you the basics, it is up to you to apply the knowledge gained, and from there, hopefully get a more in-depth knowledge of a language.\n\nHere's the deal. If you're looking to get hired as into a junior role it's up to you to give yourself an edge. Try a couple of these things\n\n1. **Go beyond page 1 of the manual**. If you're claiming to be very good at Java for example, you better know the difference between `public`, `private`, and `protected`. You need to know what the keywords `final`, `static` and `synchronised` do. For extra points: Explain package scope, and highlight your favourite new additon to the last version of the language.\n2. **Do work outside of college**. Your OO class may have shown you that a rectangle inherits from a shape, or a car from a vehicle, but nobody needs a shape class. Go write something for fun. Do an Android app, a web app, a web site. Anything that wasn't done because a lecturer told you to.\n3. **Better: Join an open source project and contribute**. Show me your github account, and you've instantly more of a chance than the 99% of the people you're up against\n4. **Show up at developer events**. There are events happening all the time. Find XCake, Pub Standards, Crafthouse, MongoDB Meetups, Ruby Meetups, etc. etc. Get to know companies who hire.\n\nWe do apps for clients. We have to make them slick, and they have to be solid. This means we need great programmers. College projects get run once for marking. Some of our projects get run 45 million times.\n\nThe good news: We found 2 awesome interns for the summer just past, and we've selected 2 for next year, which we have great hopes for.\n\nWe're still always on the lookout for new candidates though. Think you have what it takes? [Apply here](https://my.zartis.com/tapadoo/jobs/1459/mobile-apps-developer-dublin)\n"}},"__N_SSG":true}