{"pageProps":{"post":{"title":"Onboarding Best Practice; the Do's and Don'ts of Onboarding","date":"2019-06-03","content":"\n> \"The best onboarding is no onboarding.\"\n> \n> Orla Fagan, Lead UX/UI Designer, Tapadoo  \n\nOur lead UX/UI designer says that all onboarding causes friction and gets in the way of a user using your app for its purpose. If the apps UI is intuitive enough then there shouldn't be a need for an onboarding experience. Read Orla's onboarding post [here](https://tapadoo.wpengine.com/mobile-app-onboarding-patterns/).\n\nIn saying that, there are times when an onboarding experience is necessary. If this is the case for your app, then these are the best practices you should follow.\n\n#### What is onboarding best practice?\n\nOnboarding best practice is implementing a sleek and sophisticated onboarding process. It's about considering your onboarding process in-depth and implementing a process that is not only intuitive but 100% user-friendly.\n\nWhen considering onboarding you need to give some thought to the permissions you are looking for, the personal data you are collecting and the entire registration process.\n\nOnly ask for the permissions you need. The same for personal data. In fact, consider if you even need to capture personal data. If you do, how can you do it that requires minimal information from your user?\n\nIf you decide that you need a registration process make sure to include social media logins as well as email login.\n\nAre you considering doing an app tour? App tours increase user interaction. \n\nLet's look at the specific do's and don'ts around onboarding.\n\n#### **Onboarding best** practice; what you should do and don't do\n\nBelow are some tips to help you get the most out of your onboarding experience. We'll look at permissions, personal data and registration first and then some tips around your app tour.\n\n#### **1\\. Permissions, Personal Data & Registration**\n\n#### **Do**\n\n> Ask yourself what data you need. Do you really need that email? Does your app actually need a registration process?\n> \n> If you have a registration process, then include social media logins as well as email login.\n> \n> Then allow users to complete their profile later or as it naturally occurs through the user experience.\n> \n> Only ask for the permissions you need. Too many apps ask for too many permissions. Don't be one of these apps. It only makes users skeptical.\n> \n> If you need certain permission or personal data, then show the user the reasons why you need it. Showing them creates trust.\n> \n> Then tell them that the information you collect will be treated securely. \n\n#### **Don’t**\n\n> Don’t look for personal data that’s not needed. Remember GDPR?\n\n#### **2\\. App Tour**\n\nThere’s a [50%](http://info.localytics.com/hubfs/Case_Studies/Slice_Case_Study.pdf?t=1533737347138) increase in user interaction with an app onboarding tour. However, before deciding if an app tour is right for your app read this [post](https://tapadoo.wpengine.com/mobile-app-onboarding-patterns/). Below are some tips to help when considering your app tour.\n\n#### **Do**\n\n> Provide a tutorial, guided tour or walkthrough on what the user can expect from using your app, particularly if the features of your app are [innovative](https://tapadoo.wpengine.com/mobile-app-onboarding-patterns/), you are selling [aspirational ideas](https://tapadoo.wpengine.com/mobile-app-onboarding-patterns/) or have [complex set ups](https://tapadoo.wpengine.com/mobile-app-onboarding-patterns/).\n> \n> Keep the tour the same as the experience you want the user to have within your app i.e. focus on the core value.\n> \n> If you can, choose your medium for demonstrating your onboarding process pre-development. This will help you build it into your design and not just have it as an afterthought. \n> \n> Be creative with your onboarding tour. You can do it in a number of ways, such as; demos, tutorials, screen overlays, walkthroughs, and general tips. There are pros and cons to each but whatever medium you choose, keep it simple.\n> \n> Show how the app will make life easier for the user by having the user interface focused around the core value.\n> \n> And don't forget to show the number of steps involved in your tour and the stage the user is at during each stage.\n\n#### **Don’t**\n\n> Don’t overload users with too many features and too much content upfront. This can be tempting but avoid using your tour as a way to 'show off' all the features. Users just want to get in and use the app.\n> \n> Don’t assume users will intuitively know how to use your app. You may have been developing your app for a long time. Therefore, it can be hard to get an objective view of it.\n> \n> Don't frustrate users with a tour that tells them what to do. Show them!\n\n> “Your assumptions are often wrong and how you expect people to use your app is actually not how they will use it at all.”\n> \n> Ben Cole, MEC\n\nThere is a balance to be struck with your guided tour between showing too much and too little. Too much will frustrate them and cause them to leave. While too little will leave them wondering what else and may also cause them to leave.\n\n#### Getting the best out of your guided tour\n\nIf you want to see guided tours done well, take a look at some gaming apps. They generally have good guided tours and have also good retention rates. Have a look at [Tutorial 101](https://www.youtube.com/watch?v=BCPcn-Q5nKE) for some good tips on producing a guided tour. Ok, it's game focused but there are some good take aways, such as; have less text, more interaction, don’t frontload, make it fun and have a tutorial library.\n\n[Theresa Neil's](https://www.smashingmagazine.com/2014/04/rethinking-mobile-tutorials-which-patterns-really-work/) advice with guided tours is to show, don't tell. Show users what they can expect, without distracting them with too many words. \n\nYou can do this by showing a feature and then letting the user perform that feature. By performing the feature it brings them to the next level in the tour and also helps reinforce the action they need to take.\n\nIf you can stick to the do's and avoid the don'ts, you can have a succesful app onboarding process.\n\nMaria Colgan\n\nDigital Marketing Manager\n","postImage":"https://2upm2b1wdft320vzjj34rpga-wpengine.netdna-ssl.com/wp-content/uploads/2019/04/blur-display-electronics-174938.jpg.webp","categories":["ux"],"tags":["app-tour","permissions","personal-data","registration-process"]}},"__N_SSG":true}