{"pageProps":{"post":{"title":"The Future's Bright","date":"2010-02-01","content":"\nI was asked to speak at the [Young Entrepreneur](http://www.youngentrepreneur.ie/) event in Kerry last week. The organisers wanted the perspective of an iPhone developer to show that developing iPhone apps can be done with reasonably low barriers, whilst still being able to produce a viable business.\n\nI've done a few speaking events on iPhone this year; two Dev Days, Epicenter, one for Enterprise Ireland and the Young Entrepreneur event, and feel I'm getting the hang of it, but this event was particularly interesting.\n\nAt the Epicenter event last year, I attended a \"round table\" event for all speakers to have a broad discussion on the software industry in Ireland. I was bemoaning the fact that university prepared me for a job, perhaps even for a career, but it didn't suggest starting a business as an option. As I left this talk, [Chris Horn](http://chrisjhorn.wordpress.com/) came to me and said \"take a look at what Jerry Kenelly is doing in the institute of Tralee\". He suggested that Jerry has put Entrepreneurship on the programme, and that it is paying dividends.\n\nBack in January, out of the blue I was contacted by Jerry Kenelly asking would I speak at the event. Naturally I jumped at it, I'm really glad I did.\n\nWhy? Well it gave me a chance to see first hand what they are doing to promote Entrepreneurship as an option for students. Their mission is to promote \"the fact that becoming an entrepreneur is a viable career option\". They do this by running an annual Young Entrepreneur of the year competition. The event is kicked off in October and is open to all 2nd level and 3rd level students in the area. This year was also open to students in Limerick.\n\nThe event last week was the mid-programme event. It is called \"Business Boot Camp\". Its attended by all 600 entrants, and has talk from business leaders along with some practical work. What most impressed me was the respect shown to the audience. The dialog was not dumbed down or simplified for students. This was real practical advice. Speakers included former Entrepreneur of the Year (from the Ernst & Young competition, the \"Senior's\" if you will), Colum O'Sullivan of [Cully & Sully Foods](http://www.cullyandsully.com/) (who crunched the numbers with a student), and the most revered man in Kerry, Kerry Bainisteoir Jack O'Connor.\n\nDuring the event, the students were given a chance to pitch their ideas. One girl in particular did a pitch worthy of Dragon's Den, and when Sully attempted to dissect them, she was quick to show how her market research stacked up. Very impressive stuff.\n\nSo there - Setting up a company is a real option. I really wish it crossed my mind 15 years ago. That's nobody's fault, but with I can't help but think that what's going on in Kerry will plant the seed for some, and could be where the next great business leader will come from.\n\nThe event will have its proof in the coming years, when a guest speaker will be able to say \"I was sitting in this audience like you just 3 years ago....\"\n\nThe future's bright.\n"}},"__N_SSG":true}