{"pageProps":{"post":{"title":"3 Mobile Marketing App Analytics Tools for 2020","date":"2020-07-06","content":"\n### 1\\. Leanplum\n\n[Leanplum](https://www.leanplum.com/) is a mobile engagement platform. Its features include mobile analytics, A/B testing, push notifications, email marketing and more. Leanplum says they offer more than 'vanity' metrics by providing clients with comprehensive mobile analytics that offer the fullest picture of how they affect your business. They also state that they are a multi-channel customer engagement platform helping forward-looking brands like Tesco and Zynga meet the real-time needs of their customers. \n\nLeanplum allows you to track the behaviour of users through their full journey within your app. The platform tracks app installs, funnel metrics, user drop-offs and churn. If you want to improve conversions and retention then Leanplum is a good choice.\n\nA big part of Leanplums offering is the ability to A/B test messaging. They allow you to track push notifications and see how one type of push notification may have increased conversions but caused app uninstalls. They provide you with a complete 360-degree view of all outcomes of your marketing campaigns.\n\n![](images/Screen-Shot-2016-07-06-at-12.12.50-PM.png)\n\n[Source](https://www.leanplum.com/blog/powerful-mobile-marketing-analytics/)\n\n### Leanplum Features\n\nMobile Analytics\n\nMobile A/B testing\n\nCampaign Composer\n\nPush Notifications\n\nEmail Marketing\n\nIn-app Messaging\n\nApp User Experience\n\nVisual UI Editor\n\nExtensive Segmentation\n\n### Leanplum Pricing\n\nLeanplum pricing is customised and the rates are not published on their website. If interested you should contact Leanplum for a [demo](https://www.leanplum.com/) and pricing.\n\n### Leanplum Reviews\n\nLeanplum receives between 4 and 5 stars across all reviewing platforms. As you can imagine, it's highly praised for its A/B testing capabilities, thus ensuring good campaigns. Also, the fact that Leanplum allows you to target customer communication across all channels; emails, push and in-app messages. Segmentation and targeting capabilities also receive praise allowing you to segment as wide or narrow as needed. The data analysis is of high calibre and is a go-to tool for analysing user behaviour.\n\nOn the negative side, there have been some comments in relation to the use of the platform. While some users have found it easy to use, the majority have found it a steep learning curve. In saying that, there has been high praise for Leanplums support team. There have been some difficulties with their API when sending events from multiple sources.\n\nThe biggest issue that will affect most businesses is the lack of transparency around pricing and contracts. If this platform is one that you require for your app you should be 100% clear on the pricing structure and terms of contract before signing up.\n\n## 2\\. MoEngage\n\n[MoEngage](https://www.moengage.com) helps businesses grow their users lifetime value by providing analytics on customer behaviour, campaign performance and product feature usage. Their insightful analytics are aimed at helping you make informed decisions on customer engagement and growth strategy.\n\nWith MoEngage, you can coordinate campaigns across channels like push, email, in-app messaging, web push, and SMS, with auto-optimization towards higher conversions. MoEngage has said their platform is used mainly by the team responsible for customer engagement and retention through campaigns. It's a campaign driven platform.\n\nThey have two key product sets; marketing automation and engagement analytics. The analytics are used to understand user behaviour, identify holes in conversion funnels, and measure app stickiness with cohort analysis. This shapes the customer engagement strategy in a data-driven way.\n\nThe marketing automation platform is integrated with analytics to reduce friction and data ambiguity. Customers can segment their users based on demographics, behaviour, preferences and run hyper-personalised contextual campaigns to engage them.\n\n![](images/Screen-Shot-2016-06-13-at-3.46.16-PM-1024x589.png)\n\n### MoEngage Features\n\nA/B Testing\n\nCohort Analysis\n\nIn-app Events Tracking\n\nRetention Tracking\n\nUninstall Tracking\n\nChannel Attribution\n\nFunnel Analysis\n\nPush Notifications\n\nRevenue Tracking\n\n### MoEngage Pricing\n\nHow much does MoEngage cost?\n\n![](images/moEngageAnalyticsPricingPlan-01-925x1024.png)\n\n### MoEngage Reviews\n\nMoEngage has 708 reviews on [Featured Customers](https://www.featuredcustomers.com/vendor/moengage) with 22 cases studies of companies sharing their challenges, decisions and results before, during and after implementing MoEngage Software. There are also 32 customer testimonials and 5 customer videos. Well worth reviewing if you are seriously interested in using MoEngage. In 2019 MoEngage was named in [Gartner's Magic Quadrant](https://www.moengage.com/moengage-in-the-gartner-magic-quadrant-2019/) with Gartner noting that MoEngage had the biggest leap in position in the Magic Quadrant and clients rating their overall experience with MoEngage among the highest.\n\nOne comment read; \"As a disruptive app, we wanted to make users feel at home and take their time while understanding and using the app. Also, we wanted to engage the users and keep them coming back to the app basis relevant and well-timed communication. MoEngage’s user analytics and engagement platform helped us achieve just that. We have witnessed CTRs of up to 30% for our campaigns.\"\n\nMoEngage has been noted for its user retention capabilities, as well as the seamless use of A/B testing. Most reviewers commented on the user interface and how easy it is to understand and use the product. Its API integration is effective and seamless. The analytics also provides a complete picture of campaigns and retention. As one reviewer noted; \"This tool handles every aspect of CRM, it's a must-have tool\".\n\nEvery marketing analytics platform has certain drawbacks and needs to be tailored as per your individual requirement. There are two recurring themes with the MoEngage platform. The first is around time. Time to load things such as the homepage and campaigns, and enhanced functionality required to make the notification sending process a lot faster.\n\nThe other issue was the price. MoEngage is not cheap. Some reviewers have noted that MoEngage is priced a little high compared to others in the market and it has been referred to as a more expensive alternative to [Clevertap](https://clevertap.com/).\n\n## 3\\. UXCam\n\n[UXCam](https://uxcam.com) was founded in 2012 with a mission of enabling businesses to deliver the best experience. They say that we are in the midst of a once-in-a-century shift in business models and that consumers are choosing experience over services. UXCam is at the heart of this shift and want to enable businesses to cut through the competitive landscape and establish themselves as an 'experience' business.\n\nThey aim to do this by delivering the best product in the form of a qualitative analytics tool for mobile. Through the best customer service by providing a fast, transparent and satisfying customer support that exceeds expectations. And finally, by doing their own mobile UX research to provide leading-edge knowledge for their customers.\n\nUXCam’s app testing and management tool platform aim to help app owners deliver the best user experience for their users. You can view recordings of users’ sessions. This functionality enables you to watch how users interact with your app and even records gestures and triggered events. You can identify causes for crashes and discover bugs that hamper the user experience. \n\nThe platform gives a clear picture of the user journey with your app, thus helping you understand the user experience better. The insights you receive helps increase app engagement, boost user retention, and reduce churn.  \n\n![](images/UXCam-1024x576.png)\n\n### UXCam Features\n\nUser Journeys\n\nHeatmaps\n\nScreen Activity Recording\n\nUsability Testing\n\nUser Research\n\nSession Analysis\n\n3rd Party Integration\n\nFull Screen\n\nRule-Based Recording\n\nPriority Support\n\nCrash Analysis\n\nScreen Analysis\n\nAdvanced Replay\n\nOffline Recording\n\n### UXCam Pricing\n\nHow much does UXCam cost?\n\n![](images/Screenshot-2020-04-02-at-15.08.10-503x1024.png)\n\n### UXCam Reviews\n\nUXCam doesn't have as many reviews across the individual reviewing platforms as the previous two analytics tools. However, the reviews that they have all repeat a similar message. Reviewers noted how being able to see what the user is doing has helped immensely with user experience. Heatmaps are also a very useful feature for user experience. Automatic tagging of activities in the playback is helpful, along with being able to watch multiple sessions of a user in a single flow. It's been noted that the UXCam support team are extremely supportive at all times.\n\nUXCam is easy to set up and use, the product performs well and there have been no issues with price, which is something you often hear with analytics platforms.\n\nThe two most common issues are the event analytics aren't detailed enough and the user experience of the product needs to be smoother with a redesign of the dashboard interface.\n\nYou can also read about the top 10 in-app analytics for 2020 [here](https://tapadoo.com/best-app-analytics-tools-for-2020-and-beyond/).\n\nMaria Colgan\n\nDigital Marketing Manager\n"}},"__N_SSG":true}