{"pageProps":{"post":{"title":"6 Ways to Improve your Apps User Experience","date":"2020-09-14","content":"\nIs your mobile app suffering from [\"everything but the kitchen sink\"](https://tapadoo.com/focused-engagement-through-ux-design-strategy/) syndrome?\n\nWe often find when working with new clients on their user experience design strategy that they start with an ambitious goal for their app. They want 'everything but the kitchen sink'! While it's useful to have good features within your app, we know that apps work best when they are focused.\n\nWhen your original idea gets diluted and you have an app that caters for too many needs you end up with an overcomplicated digital product that only serves to frustrate the user. When we design a user experience strategy we take a user-centred approach. We are an advocate for the user, that's why the apps we have designed and developed have had great success. We keep it simple!\n\nIf you find yourself with an overcomplicated app here are a few things you can implement to streamline the user experience within your app.\n\n### Focus on the top task\n\nThe number one reason for a mobile app is convenience. Our CEO gives a very good talk on this. You can watch the video [here](https://www.youtube.com/watch?v=YJt3b62YgdU&list=PLilWfRvnyxzZGID9nkPgAgtO4rx3YPGsi). When users log into your app it's for convenience. They want to be able to complete a task as quickly and efficiently as possible. They don't want to navigate to a number of screens to complete this task or to have it hidden by an obscure icon.\n\nWhether you have a banking app that customers want to be able to check their balance at a glance or transfer money quickly, or a retail app that users want to find and purchase a product instantly, there is generally one or two primary tasks a user wants to complete.\n\nIf your app has been overloaded with features and content and that primary task has been lost then you need to strip everything back and focus on the top task.\n\n### Use the data and listen to users\n\nIf you are unsure what the number one focus task of your app is, then check your data and ask your users. It may not be as obvious to you what the focus task should be as you are trying to be as helpful as possible to your users, and possible stakeholders, but the data will show the real picture. As will the feedback from your users. Allow the data to inform you of the top one or two tasks that are completed in your app daily.\n\nBut also, check-in with users. Find out what their big reason for using your app. You may be surprised to find your assumptions challenged. You may also find that a feature isn't being used because it's hidden, but that doesn't make it less important to a user, especially if it's something that can make their user journey more enjoyable.\n\nCombining both the data and user feedback will give you a holistic view of the reasons users use your app. This will help you streamline your process.\n\n### Streamline the user experience\n\nNow that you are clear on the top tasks users want to complete within your app make it as easy as possible for them to do this. Start by looking at how you can make entry points easy to find on the navigation bar and menus. The goal is to make completing a task as convenient as possible for users. They want to get into your app and get to that task as quickly as possible. When users get to the task they want to do it as efficiently as possible. Users shouldn't have to go deep into the structure of the app to complete the task. The main tasks should be one tap away from the home screen.\n\nYour goal here is to make sure entry points are easy to find. Users should be able to access them at the touch of a button. Don't have them going into a 'more' button or use an obscure icon that gives no clear direction. Also, if users use your app for a specific reason but you want to prioritise other business needs over this then you end up frustrating and losing users. Save users time and effort to complete their goals within your app, they'll appreciate you more in the long run and be happier to buy from you in the future.\n\n### A/B test the user experience\n\nBefore jumping into doing an overhaul of your app, begin testing new features to see how users react to them. We've written some previous posts on the best practice of A/B testing on mobile apps and the best tools to do mobile app A/B testing. A/B testing features on your mobile app means you are not making changes blindly. You make the changes, test them out and wait to see how users react. You are relying on your data to give you accurate results before moving to make the bigger changes to the user experience design of your app.\n\n### Have a sleek search option\n\nHaving a sleek search option is essential for apps with different categories. It's particularly frustrating for users of shopping apps if they can't filter to search for the item they are looking for. Users expect the search option to be obvious on the screen and then it to bring them to exactly what they are looking for. Have the search option visible, let it stand out and don't hide it behind an obscure item or have it in a place on the screen that's not the norm for the search function. As the user is typing in the search box show relevant results to make it easier for them to tap what they are looking for.\n\n### Allow feedback in-app\n\nDid you know that [98%](https://go.apptentive.com/Feedback-Loyalty-On-Mobile-Frontier.html) of app customers are likely to give feedback when asked? And that [64%](https://go.apptentive.com/Feedback-Loyalty-On-Mobile-Frontier.html) prefer to leave feedback in-app? Feedback from users is invaluable and the best time to ask for this feedback is when they are in your app. Making them leave your app to go somewhere else to leave this feedback is another pain point. By asking for feedback in-app users are most likely to share their ideas and point out specific problems they are having.\n\nHaving a tool for in-app feedback allows you to collect feedback 24/7. It also helps improve the overall user experience of your app. You can use the feedback to improve a particular feature of your app, make something more discoverable or engage users in a deep-dive conversation about the overall experience of your app.\n\nMaria Colgan\n\nDigital Marketing Manager\n"}},"__N_SSG":true}