{"pageProps":{"post":{"title":"Are Apple updating too frequently?","date":"2015-01-06","content":"\nWow. Marco Arment published an [interesting blog post](http://www.marco.org/2015/01/04/apple-lost-functional-high-ground) yesterday. He's gone on to say [he regrets doing so](http://www.marco.org/2015/01/05/popular-for-a-day). Though his blog post has been sensationalised by a lot of the media, it has also sparked some very interesting debate.\n\nIt also made me think about a topic that's been burning for us for quite some time. We don't write apps for ourselves (well, maybe [one](http://mydublinbus.com)), but we're not indy developers who rely on App Store sales for our income. Instead, we're a development services company. Our income comes from selling our skills, and we focus solely on mobile app development.\n\nBut the rate of updates has been having an affect over the last couple of years. It's affecting our customers, and here's why:\n\n> For most companies, a yearly release is simply too fast.\n\nWe work with banks, telecom companies, and major brands. By their nature, they like to work in a considered fashion. Much of the decision making process requires multiple opinions and sign-off procedures. Project timelines of more than six months are not uncommon.\n\nSo how does a yearly release cycle fit in with a six month project?\n\nNot great, to be honest.\n\nConsider a typical project six month project. Pick it to start any time in the year. iOS goes beta every June.\n\nQ1 start? Your project is ready for release pretty much during the iOS beta cycle. Remember, our customers like the comfort of us using production, non-beta toolchains.\n\nQ2 start? We've just released, but end-users are already migrating to the new operating system version, so we'll have to bring out a new version quickly to keep up.\n\nHow about a Q3 start? Okay, maybe. We'll be starting with the latest and greatest version of a production operating system, but our customers will still worry about those users who are still on the older version (if the market share of iOS _n_ is less than 90%, they will be concerned about the 10%).\n\nQ4 start? Maybe, but we'll be launching just as the beta cycle is beginning.\n\nNew versions are a boon to indy developers. A new version gives them a chance to utilise new features and might give them a chance to sell more copies of their software. For enterprise (where [Apple are starting to look towards](https://www.apple.com/ipad/business/)), yearly is simply too quick.\n\nThe changes in the last couple of years have been pretty drastic. iOS 7? We need to change the complete styling (and [we spoke about this before](https://tapadoo.wpengine.com/2013/ios7-move-now-or-be-an-insta-delete/ \"iOS7. Move now, or be an insta-delete.\")). iOS 8? Major changes to auto-layout and rotation.\n\nWe've seen some concern from clients too. They find it hard to understand why something written six months ago now doesn't lay out correctly on newer operating system versions, or indeed why they should pay for the fix.\n\nThis isn't limited to iOS. Android is maintaining the same pace of releases. So we encounter the same problems there too. Ironically, they're doing this to each other. Both the iOS and Android camps are now scrambling for \"me too\" features. The fear of being outdone by one another is fuelling all of this.\n\nI wonder if we went to 18 month release cycles, would it get better?\n\nImage Credit: [Microsiervos on Flickr](https://www.flickr.com/photos/microsiervos/)\n"}},"__N_SSG":true}