{"pageProps":{"post":{"title":"Award-Winning App Development Company","date":"2019-12-10","content":"\nWhen the Apple App Store launched in 2008 there were 500 apps. As of the third quarter of 2019, there are [1.8 million on the Apple App Store](https://www.statista.com/statistics/276623/number-of-apps-available-in-leading-app-stores/), [2.47 million on the Google Play Store](https://www.statista.com/statistics/276623/number-of-apps-available-in-leading-app-stores/), [669 thousand on the Window Store](https://www.statista.com/statistics/276623/number-of-apps-available-in-leading-app-stores/) and [487 thousand on the Amazon Appstore](https://www.statista.com/statistics/276623/number-of-apps-available-in-leading-app-stores/).\n\nWe've played our part in this.\n\nSo much so, we've been recognised as one of the top 1000 B2B companies on Clutch. This may not seem like a lot, but considering they're over 160,000 services providers on Clutch this puts is pretty much ahead of a lot. In fact, we are now in the **top 1% of B2B companies on Clutch**.\n\n![](images/Clutch-1000-Badge-1024x1015-1.jpg)\n\n**Tapadoo Named Among Top 1000 B2B Global Companies on Clutch**\n\nThe Clutch 1000 is a list of the top 1,000 B2B companies listed on their site.\n\nTapadoo is one of over 200 mobile app development companies in the Clutch 1000 and the only company from Dublin, [Ireland](https://clutch.co/ie/app-developers)!\n\nThis award means a lot. It is based on the opinions of our clients.\n\nClutch conducts independent research with the past clients of companies to ensure all rankings on their site are fair and verified. This award and our 5-star rating on Clutch are all thanks to the clients we have partnered with, who have chosen to acknowledge us in such a public way.\n\nHere's an example of a review from one of our clients\n\n![](images/Screenshot-2019-12-04-16.49.31-1024x740-1.png)\n\nYou can read our reviews on Clutch [here](https://clutch.co/profile/tapadoo).\n\nWe're proud and honoured to be part of the Clutch Top 1000 Companies Globally. As a small software company from Dublin sharing this recognition with some of the largest and heavily funded companies in the world is a big achievement for us.\n\nOur work is also featured on sister sites of Clutch including the [Manifest](https://themanifest.com/app-development/android/companies) and [Visual Objects](https://visualobjects.com/profile/tapadoo).\n\n### Award-Winning App Development Company\n\n2019 has been a good year for us and we certainly feel like an award-winning app development company. We've been fortunate to have won a number of awards from Clutch. Back in June of this year, we won an award for a [Top Wearable App Developer for Wearable Technology](https://tapadoo.wpengine.com/tapadoo-named-top-wearable-app-developer-2019/).\n\nWe've also been noted as part of the [top 100 Android app developers](https://themanifest.com/app-development/android/companies) on the Manifest.\n\nIf you'd like us to develop your app project [get in touch](https://tapadoo.wpengine.com/contact/).\n\nMaria Colgan\n\nDigital Marketing Manager\n"}},"__N_SSG":true}