{"pageProps":{"post":{"title":"6 Brand Advocate tactics in mobile app marketing","date":"2019-04-15","content":"\nBrand advocates are central to your marketing initiatives. These are the people who will speak on behalf of your brand.\n\nMove your clients seamlessly through each stage of the funnel and you could have an abundance of them at your fingertips.\n\n#### **What are brand advocates?**\n\nBrand advocates are your loyal users. You create loyal users by continuously meeting and exceeding their needs within your app. Deliver an exceptional user experience and users will naturally become loyal to your app.\n\nBrand advocates speak highly of your app and recommend it to others. They do this in person, with online reviews, through social media posts, and in-app referrals.\n\nAs well as being loyal, brand advocates are also your most motivated users. They need to be motivated to speak about your brand.\n\nIt’s fair to say that not all users who are loyal to your brand will advocate for it. It’s the ones who are motivated enough to speak on your behalf that you focus your effort on with your brand advocacy campaign.\n\nSo let’s look at some tactics to create brand advocates and in doing so generate word of mouth marketing.\n\n#### **Tactics for creating a brand advocate program**\n\n#### **1\\. Exceptional Customer Service**\n\nWhen users become loyal to your app you’ve reached a very important milestone in your app journey. You’ve mastered the user experience and ended up with a very happy user base. This is the time to start a brand advocate program.\n\nTurn your loyal users into motivated ones, so that they can become your brand advocates and talk positively about your brand. \n\nHow do you do this? \n\nStart with exceptional customer service. Customer service where you go above and beyond.\n\nHave a customer support system within your app and respond to users needs quickly and efficiently. Users shouldn’t need to leave your app to contact you by email.\n\nProvide a comprehensive help centre or FAQ section for the most frequent issues that users can access easily. Then make it easy for them to create a ticket within your app to report other issues.\n\nGive users an unexpected gift of a free upgrade trial. Answer their most pressing questions. Provide updates on new features and upgrades in your app.\n\nIt costs [80%](https://www.socialmediatoday.com/content/importance-building-community-brand-advocates) more to gain a new user than to retain an existing one. It makes sense to invest in an exceptional customer service programme. \n\n#### **2\\. Listen and engage** \n\nListen to what users are saying on social media and thank them for their review. Address unhappy users or reviews in a personal way and you may have the opportunity to win them back. Tell them that you will incorporate any issues into your next set of changes. Reaching out to users in a personal way makes them feel valued. This reinforces their loyalty to your brand.\n\nEngage your loyal users and ask them to repost, retweet and share your content with their own followers. \n\nActively look for reviews from loyal users. [98%](https://www.apptentive.com/blog/2017/02/07/mobile-customer-experience-strategies/) of app users said they are likely to give a review if asked. This generates word of mouth marketing and makes other users become loyal to your brand.\n\n[Brand Ambassador](https://brandambassadorapp.com) and [CrewFire](https://www.crewfire.com) are two platforms that help you manage your brand advocates. With [CrewFire](https://www.crewfire.com) ambassadors share your content. They receive a notification when you have new content and are rewarded when they share it with their own following. [Brand Ambassador](https://brandambassadorapp.com), on the other hand, allows your brand advocates to create their own content.\n\n#### **3\\. Create an interactive and creative brand advocate campaign**\n\nDevelop an interactive and creative brand advocate campaign. Create something that is fun, interactive and can spread. \n\nTake your cue from campaigns like the ALS ice bucket challenge, which started in 2014. It was designed to raise awareness and funds for Amyotrophic Lateral Sclerosis disease. The challenge was to throw a bucket of iced water over your head and to challenge three other people to do the same. The campaign was fun and engaging. It was so successful that over [17 million](https://eu.usatoday.com/story/news/2017/07/03/ice-bucket-challenge-5-things-you-should-know/448006001/) people took part in it and raised [$115m](https://eu.usatoday.com/story/news/2017/07/03/ice-bucket-challenge-5-things-you-should-know/448006001/).\n\nAnother famously creative campaign is the Cadburys Dairy Milk ad of 2007 that saw a gorilla play the drums. Ok, a more expensive option but a creative one.\n\nIt was so successful that [58,000](https://www.campaignlive.co.uk/article/gorilla-ad-works-its-magic-sales-cadbury-bars/784573?src_site=brandrepublic) households took time out of their busy day to watch a long-form version of the ad using their red button. Cadbury also saw revenue growth of [5%](https://www.campaignlive.co.uk/article/gorilla-ad-works-its-magic-sales-cadbury-bars/784573?src_site=brandrepublic) during 2007.\n\n#### **4\\. Incentives and rewards**\n\nUsers are motivated by incentives and rewards. They are more likely to like and share your social media posts and to give reviews if they are incentivised. In fact, [79%](https://www.getambassador.com/blog/word-of-mouth-marketing-statistics) of people say their primary reason for liking a company’s Facebook page is to get discounts.\n\nIncentives are a great way to get your brand advocates program started. They give the initial push for users to align with your brand. You could offer a reward for users who share their experience of your app with their social media followers.\n\nIf your app sells products within it you could offer discounts. Or you could provide an upgrade to a better service within the app, such as an ad-free version. You could also reach out to your brand advocates in person by throwing an event especially for them. Give them the VIP treatment.\n\n#### **5\\. Referral Program**\n\nYou can’t mention a referral program without mentioning Dropbox. They had one of the most successful referral program campaigns of all time. Within 15 months they grew their users from 100,000 to 4 million. Dropbox doubled its user base every three months over a two year period. Dropbox’s current valuation is [$7.5bn](https://www.ft.com/content/fc283fac-25e4-11e8-b27e-cc62a39d57a0) and according to founder/CEO [Drew Houston](https://twitter.com/drewhouston), referrals increased signups by 60% permanently.\n\nCan you imagine if each one of your loyal users brought in one referral? Your app numbers would skyrocket. And the retention rate for referrals is really good at [37%](https://www.slideshare.net/brandonmurphy/brand-advocacy-and-social-media-2009-gma-conference).\n\nMake it easy for users to refer others to your app. Have a referral section within your app, that users can click into. Then ask users for a referral and offer an incentive for doing so. Use all of your distribution channels to talk about your referral program.\n\n#### **6\\. Become your own brand advocate**\n\nWhen others talk about your brand in a positive light, share these comments across platforms. This is a way to demonstrate your brands value through user reviews. It’s not you highlighting how great your app is, it’s your users. You are just sharing their reviews. Too often, apps don’t highlight what their users say about them.\n\nEmpower your employees to become your brand advocates. The 2016 [Edelman Trust Barometer](https://www.edelman.com/research/2016-edelman-trust-barometer) indicates that employees are three times more trusted than the CEOs of those companies. So it makes sense to empower them to become your brand advocates. Create an employee advocacy program and encourage your most trusted and dedicated employees to speaking positively about your app.\n\n#### Conclusion\n\nWe have covered a number of areas in our mobile app marketing strategy over the last few weeks. Starting with our [planning phase](https://tapadoo.wpengine.com/mobile-app-marketing-planning/), we then looked at [acquiring new users](https://tapadoo.wpengine.com/8-user-acquisition-tactics-app-marketing/), [activating new users](https://tapadoo.wpengine.com/user-activation-mobile-app-marketing/), [retaining these users](https://tapadoo.wpengine.com/user-retention-mobile-app-marketing/) and now brand advocates.\n\nMaria Colgan\n\nDigital Marketing Manager\n"}},"__N_SSG":true}