{"pageProps":{"post":{"title":"Clutch Names Tapadoo Top B2B App Development Company","date":"2020-02-17","content":"\nThe first line of the latest [Business Post](https://www.businesspost.ie/smes/app-creator-turns-fun-sideline-into-thriving-firm-with-25-staff-927b1ace) article on Tapadoo reads; 'Dermot Daly started creating apps for fun in 2009. Ten years on, his company employs 25 people.\n\nWhat may have started as fun has turned into a team of 25, dedicated to the pursuit of mobile app development.\n\nWe've had a lot of success stories in the last 10 years. And it's always an honour to be recognised for our longstanding efforts and [commitment to mobile app development](https://tapadoo.wpengine.com/meet-the-team/).\n\nThe latest recognition from B2B Ratings & Review Platform [Clutch](https://clutch.co) has named us ['Top B2B App Development Company for Ireland'](https://clutch.co/ie/app-developers/dublin).\n\n![Top B2B App Development Partner. Image of award from Clutch for 2020.](images/B2B_Companies_Ireland_2020-947x1024.png)\n\nThis recognition is a result of our clients taking time out of their busy day to give in-depth feedback on our service. They participated in client interviews to assess our impact on their day to day operations. We were ranked on the basis of our attention to deadlines, quality of service, and cost-effectiveness.\n\nWe've been given five out of five stars by many of our clients. Below is one such example of feedback we've received from a long-standing client.\n\n![Top B2B App Development Partner. Image of a client review from Clutch.](images/Screenshot-2020-02-11-15.25.29-1024x723.png)\n\n> \"Tapadoo is one of our best partnership engagements for software programming.\"\n> \n> Mark Ennis, Prepay Power\n\nWe’ve also been recognized by Clutch’s sister sites, The Manifest and Visual Objects. The Manifest, a business data resource, names us on their [list of app experts](https://themanifest.com/software-development/app-modernization/companies#tapadoo). We’re also mentioned on the [Visual Objects developer directory](https://visualobjects.com/app-development/top-mobile-app-development-companies#tapadoo) as leaders in our area. \n\nWe’re committed to keeping up this level of service and dedication to our clients. Please [drop us a line](https://tapadoo.wpengine.com/contact/) if you’d like to collaborate with Tapadoo on a project today. \n\nMaria Colgan\n\nDigital Marketing Manager\n"}},"__N_SSG":true}