{"pageProps":{"post":{"title":"Creating the Perfect App – Financing Your App Idea","date":"2020-04-06","content":"\nSo, you’ve got to the point where your app has [passed all the tests](https://tapadoo.com/creating-the-perfect-app-where-to-start/) and you truly believe it will be a success. Now to the hard question, where will the app financing come from for it to be developed? \n\nAre you looking to fund the development yourself from your life savings, find and persuade a business angel to provide you with the funds you need or is there funding available in the form of grants that you can apply for? \n\nDo you have any idea of how much money will be needed to complete the development, testing and marketing steps that are required for your app to reach the marketplace? \n\nThe question we get asked most frequently in Tapadoo is [“how much does an app cost?”](https://tapadoo.wpengine.com/quick-quote). It’s impossible to answer this question completely until the app has been through a design workshop, but we can tell you that apps can cost about €20K to develop.\n\n### Costs associated with apps\n\nThe cost of developing an app can vary depending on a number of factors, one of the main factors being what platform you want the app to run on. If you want both an iOS and an Android app then that means twice the costs as you are building an app for two completely different platforms. \n\nYou can, of course, look into cross-platform development, but if you read one of the [best blog posts written on cross-platform development](https://medium.com/airbnb-engineering/sunsetting-react-native-1868ba28e30a) you soon realise that this will end up costing you more.\n\nThe features within your app will also determine the cost. There's no such thing as a [simple request](https://tapadoo.com/and-wed-like-to-allow-users-to-message-each-other/) in software development. What seems like a simple request can end up costing a lot.\n\nAlso, don’t forget that you need to factor in the cost for the ongoing maintenance and support of your app once it has reached the marketplace.\n\nApps need updates to fix problems found by users, but they also often need updates following changes to the operating systems that they run on. Changes to iOS and Android can have unexpected implications for apps that you need to manage if your app is not going to become defunct over time.\n\n### Find your funding\n\nThe first thing any [](https://www.localenterprise.ie/)start your own business grant or angel investor will want to know if you have an app idea is ‘What’s your revenue model? How is your app going to make money?'\n\nIf you are looking for funding from a business angel, then they will want to see a fully costed and detailed business plan with revenue projections and profit forecasts.\n\nDo not underestimate how much effort will be required on the financing of your app idea. Often it can take significantly more time than you spent coming up with, understanding and refining your original idea. If you’ve come up with a revenue model that is credible and shows that it delivers a financial return then there’s a high chance that you’ll be accepted onto an accelerator programme where you can pitch to investors for funding. \n\nWe would never recommend that you throw all of your life savings into developing an app, success can never be guaranteed, even for the best app ever developed. App ideas with 'great potential' and an 'initial investment' of €150k upwards have failed to reach the market.\n\n### What's your Revenue Model?\n\nBuilding a successful app means implementing a revenue model that will sustain your app in the long run. Investors will want to see a monetisation strategy in place. A number of revenue models for apps already exist, so you don't need to reinvent the wheel.\n\nBefore deciding on a revenue model you need to ask yourself some questions. What makes your app so great that users will pay for it? How do other apps similar to yours make money? Has your competitor's revenue model worked for them?\n\nWill you offer a free app or paid app? If you offer a free app how will you make money within the app? In-app advertising? Sponsorship? In-app purchases? Upgrade to premium features? Subscriptions?\n\nIf you're looking at in-app advertising think of Facebook. They gather a massive amount of data to sell their advertising space off the back of. Spotify offers in-app advertising too but then users can bypass this by upgrading to a subscription model. Dropbox is a good example of an app that is free with basic features but again offers upgraded features for a subscription fee.\n\nSponsorship models are usually for more established apps. The weather channel is a good example of how sponsoring an app works. Subway previously sponsored the PrePlay football game app to engage sports fans during the Super Bowl XLVI.\n\nYou should be clear on your revenue model from the outset of development.\n"}},"__N_SSG":true}