{"pageProps":{"post":{"title":"@end","date":"2014-08-21","content":"\nJust a little blog post to sign off on our last day. I've had an incredible time working at Tapadoo, it was a pleasure collaborating with each member of the team, and I have made so many new friends. The constant stream of new projects and problems to be solved always kept us interested and engaged. However, It was not without its challenges along the way. But no matter how difficult things got, help and guidance was never far off.\n\nThe atmosphere in the office was always welcoming and friendly, and I enjoyed getting up for work every morning. Out of the office, we had some great times, like going to [Úll](http://2015.ull.ie/), the conference co-organised by [Dermot](https://twitter.com/dermdaly). This was a real highlight of the internship for me. We got to listen to some brilliant speakers, and hear right from the source, how great ideas take shape. Our office day out to the Leinster Hurling Cup Final in Croke Park was also a lot of fun, shame Dublin didn’t win, or we might have gotten the following Monday off!  Trying sushi for the first time was a completely new experience, and the occasional sushi lunch was always to be looked forward too! Can't forget Cake Day either, a small thing that brightened up every week.\n\nI’ve enjoyed every minute of working at Tapadoo, and really value the experience I’ve gained. From the very first day I felt part of the team. I think It’s safe to say I’ve learned more in these 5 months than I have in the first 3 years of college. No one knows what final year will throw at us, but I think working at Tapadoo has prepared me for all eventualities!\n\nI’m going to continue mobile development, and hopefully pursue a career in either Android or iOS, perhaps even both! Tapadoo has given me a fantastic start, which I’m very grateful for.\n\nI'd just like to say thanks to Dermot, and all the Tapadoo team for an unforgettable time. And thanks for the excellent farewell gift :)\n\n[![IMG_0113](images/IMG_0113-765x1024.jpg)](https://tapadoo.wpengine.com/wp-content/uploads/2014/08/IMG_0113.jpg)\n\nOver, and out. - [Kevin](https://twitter.com/kpmmmurphy)\n"}},"__N_SSG":true}