{"pageProps":{"post":{"title":"Everyone hates the autoplay feature. It's a tiny change to get rid of it","date":"2020-02-07","content":"\n> **\"Well, just because people are vocal about it, doesn't mean everyone hates it, we should probably run a survey and check analytics\"**  \n>   \n> \"The findings are in! Loads of people hate it, some like it. If we get rid of it we'll annoy 7.24% of our audience\"  \n> \"The retention team don't like the sound of that figure...\"  \n> \"We better make it configurable on the account so.\"  \n> \"On the _account_, or on the _profile_?\"  \n> \"What do you mean?\"  \n> \"What if, Mom likes the auto play feature, but Dad hates it?\"  \n> \"ahhhhh\"\n\n> **\"Hey everyone, we're going to make the auto play feature configurable!\"**  \n> \"Wait. When you say 'auto play feature' do you mean the feature where you're finished watching an episode and the next one auto plays?\"  \n> \"YES!\"  \n> \"NO!\"  \n> \"Huh?\"  \n> \"Well, I\"m talking about the feature where I'm trying to _browse_, and it auto plays trailers\"  \n> \"Well, _I'm_ talking about when the next episode auto plays\"  \n> \"Oh\"  \n\n> **\"OK, We better make both of them configurable\"**  \n> \"Someone call the UX team, and find out the best way to do it\"  \n> \"And let the database team know we'll need a new flag on the user profile table\"\n\n> **\"A new flag? What will be put in as default for the hundreds of millions of existing profiles?\"**  \n> \"Let's meet up to discuss this\"  \n\n> **\"Who's responsible for the API? They're going to need to make a change to carry the new flag\"**  \n> \"you mean flags.\"  \n> \"Yes. You're right 'flags'\"\n\n> **\"The API team have been in touch; they've made the new change to the login profile, they want to know should they change the POST to profile to change the value?\"**  \n> \"What for?\"  \n> \"To _save_ the user's preference\"  \n> \"Oh, yeah. We better get that done too\"  \n\n> **\"How are the front end team doing on the UI?\"**  \n> \"Awaiting designs\"\n\n> **\"The UI team are done. The new switch is in the profile screen, it's working great on chrome and safari. Just have a minor fix for Firefox to complete\". It'll be in QA by tomorrow.**  \n> \"Right, how are the Apple TV team doing?\"  \n> \"Oh, they've a scheduled release in 1 month, so this change is on their backlog\"  \n\n> **Have the carousel team wrote the code to not auto play?**  \n> yep!\n\n> **\"What about the LG TV Team?\"  \n> \"What about The Android Team\"  \n> \"The iPad Team?\"  \n> \"The Roku Team?\"**\n\nHat tip: [Des Traynor](https://twitter.com/destraynor) wrote the original \"[There are no small changes](https://www.intercom.com/blog/there-are-no-small-changes/)\". I send this to anyone who will listen.\n"}},"__N_SSG":true}