{"pageProps":{"post":{"title":"First Week as a Tapadoo Intern","date":"2014-04-04","content":"\nOn my very first day, I must admit, I was nervous. Walking in the doors of the Tapadoo HQ, I thought that the transition from college to a real life working environment was going to be quite stressful. I was worried I wasn't as prepared as I should have been. But, after meeting everyone in the office, this feeling quickly faded. Everyone went out of their way to make us, myself and Aidan([@aidangrabe](https://twitter.com/aidangrabe \"@aidangrabe\")), feel like part of the team.\n\n[![IMG_20140401_150710](images/IMG_20140401_1507102-1024x458.jpg)](https://tapadoo.wpengine.com/wp-content/uploads/2014/04/IMG_20140401_1507102.jpg)\n\nWe had a small stand up where everyone introduced themselves to help break the ice.  I was given a nice shiny iMac to work on (Picture below), and was chosen to join the Android developers( or The Dark Side). There is an apparent sporting rift between feelings towards IOS and Android in the office, which  often leads to some interesting conversations!\n\nAlmost straight away I was given access to the company's code base, and allowed look through their various projects, which really helped get a feel for the standard of coding required, and to see the implementation of modern development techniques.\n\n[![IMG_20140403_084253](images/IMG_20140403_084253-768x1024.jpg)](https://tapadoo.wpengine.com/wp-content/uploads/2014/04/IMG_20140403_084253.jpg)\n\nGetting use to the various software development systems,  like Git, Bitbucket, YouTrack for bug Tracking, and Android Studio takes sometime, but everyone is more than willing to help out with any questions.\n\nThe first few days were a big learning curve, but slowly I'm making my way through different tutorials and documentation,  reviewing code and trying to take in as much as possible. It's safe to say I've learned more about software development in the last 4 days, then I did sitting in lectures for the last 6 months.\n\nI began fixing some minor bugs on an in progress app for a telecoms company, and pushed the fixed code back to the project's repository, which was a proud moment. I wouldn't have imagined I'd be working on genuine projects so soon after orientation, but we were encouraged to delve right in at the deep end, and I think that's for the best!\n\n[![IMG_20140402_174134](images/IMG_20140402_174134-1024x768.jpg)](https://tapadoo.wpengine.com/wp-content/uploads/2014/04/IMG_20140402_174134.jpg)\n\nWednesday in the office is Cake Day, where one member of the team bakes a cake the previous night, and brings it in for everyone to enjoy. This is cause for great merriment when break time comes around, and it'll be a lot of fun, or complete disaster, when my turn comes!\n\nTo finish off the first week, the entire office when out for a delicious sushi lunch, and  I have to say, it has change my perspective on seafood for the better! It was a great time to sit down and relax. At Tapadoo, there's a nice mix of work, and play. I can see myself getting very use to it here!\n\nThink that's about it for this week, but there will be much more to come soon!\n\nKevin (Murph).\n"}},"__N_SSG":true}