{"pageProps":{"post":{"title":"Hello, World!","date":"2015-04-07","content":"\n_Hello, Bonjour, Guten Tag, etc_!\n\nI’m Emily, the newest intern here at Tapadoo and it’s a pleasure to ‘_e-meet_’ you. I’m a third year Computer Science student from Cork, but have just started my second week in Tapadoo for placement. Of course, moving up to the big smokes for a small ol’ Cork mouse was a big step for me, but it was all worth it for such a great opportunity like working in Tapadoo.\n\nMy experience in coding has all been in Java and web design, both of which are pretty different from the environment in which you would make an iOS app (the ones that run on your iPhone, as opposed to your samsung or android based device). However, I’ve always leaned towards the more creative things in life, and this style of work was one of the areas that I was most interested in from the beginning. It seems like the perfect balance between creativity, technology and logic - a great match for me. Also, having object oriented programming under my belt usually means that languages like Objective C are pretty intuitive.\n\nI was very lucky to get a position here, as it seemed to be one of the more coveted positions going for placement. You can’t deny the cool and laid back vibe that exudes from the business while still creating aesthetically beautiful and perfectly functional apps. It was the type of work ethic I knew I would love to be a part of.\n\nWhen I got the position, I was delighted but also nervous because, as mentioned before, my experience has all been in the Java/Web design side of things so far. So when the first day rolled around, I wasn’t quite sure what to expect. Now, on day 5, I’ve settled in and am well on my way to getting involved in some of the exciting projects that are going on here.\n\nIts strange to admit that I have learnt so much in such a short period of time, but I have. The main things I’ve learned is that industry is so different from college but in a fantastic way. Self learning is encouraged even more so than in the lecture halls, and there is such a great sense of fulfilment when you finally get the table view scene to work the way you want it to (I’m not going to delve too much into that last statement, it’s still quite a sensitive topic for me…). Whats more, there is a crazy amount of material online to not only get you started on development, but bring you all the way to making a basic but fully functional app.\n\nWhen in college, I always used the excuse that I was too busy to learn new programming languages, which was actually just clouding over a mindset that since it wasn’t handed to me by lecturers, I wasn’t too pushed. After just five days of tutorials and online lectures and reams of documentation I’m getting to a level where I can be a part of a project that will eventually be part of the app store, which is incredibly exciting. Of course, the environment I’m in is encouraging all of this which is always helpful - Tuesday’s baking days always make that little ‘_aprés Monday_’ slump a lot more bearable - and I find myself coming in earlier and earlier just to talk to Jacq about her cats and run any potential ailments off Dr. Mike. But the idea that all of this knowledge is at my fingertips just waiting to be tapped into is something that I will definitely be utilising to my benefit during this term of placement and beyond.\n\nAll in all, I’m lucky enough to say that I’m no longer worried about the 6 months ahead but excited and determined. However, in terms of the nearer future, if I can run a project without getting ‘**THREAD 1 SIGABRT**’, then that’s good enough for me.\n\nImage Credit: [Windell Oskay on Flickr](https://www.flickr.com/photos/oskay/)\n"}},"__N_SSG":true}