{"pageProps":{"post":{"title":"Networking Out the Wazoo","date":"2009-09-11","content":"\nWe've got biz camps and bar camps, open coffees, networking (with or without speed), developer garages, meetups, tweetups, seminars, congresses and a whole host of other such events. One could easily spend their entire week going to events to network and get one's business \"out there\".\n\nBut in these difficult times, attendance at these events skyrockets. Everyone is there to raise awareness of their company, looking for business, staring a new business, etc. Here's the question\n\n> Is there much _actual_ business going on?\n\nAlmost everyone is a seller, very few are buyers. In fact, buyers don't need to attend network events to find suppliers. Most people's compelling reason to go along is to speak rather than to listen.\n\nOk. I'll caveat some of this\n\n- _I know_ that networking events are to make contacts, that may be fruitful in the long term, not necessarily right now.\n- _I know_ that effective networking is about listening first\n- _I know_ that going along to networking events is important and beneficial\n\nBut.\n\nYou can kid yourself that attending these events is very high priority, important work; essential to your business. Sure its important, but its not the _most_ important.\n\nI often refer to this kind of non-essential work as \"_non work_\". The kind of work that you can claim (to yourself) that you're working, when in fact, you're actually doing something **more enjoyable** than the stuff **you should be doing**. (Writing a blog entry when I should be coding anyone?). We all do it, but sometimes there's a need to focus.\n\nI'm not suggesting that one shouldn't go to events such as these, I just think you need to choose wisely. Go along to a few, and you'll find the same names and faces. Its great to speak in person to those people you've only ever conversed with on twitter, but there isn't a benefit in having the same conversation with the same person in 2 days time.\n\nSo...review you calendar, then take a look at the deadlines you've set to getting the _actual_ work done. What's a better use of your time? Going to that event, or finishing the product features roadmap?\n"}},"__N_SSG":true}