{"pageProps":{"post":{"title":"New App - Irish Sports Council Medications Checker","date":"2011-05-17","content":"\nI always like announcing new releases; We don't always get to showcase our work; Some of the work we do would be \"proof of concept\" apps which are used to sell ideas internally in a company, others are \"white label\" type deals where our client is selling on. But then there's apps like this one. The Irish Sports Council Medications Checker.\n\n[![Available on the App Store](images/App_Store_Badge_EN_0609-100.png \"App_Store_Badge_EN_0609-100\")](http://itunes.apple.com/ie/app/medication-checker/id432509378?mt=8)\n\nWhat I like about this app is it that it's the quintessential mobile app. The app makes a real-time request to find out if a drug is banned under the world anti-doping guidelines. If an athlete is about to take something to cure a headache, they need to know the answer on the spot, especially when they are find themselves in the pharmacy about to purchase some relief medicine. Now they whip out their iPhone, check, get their answer and record the fact that they checked right then and there. Job done.\n\n[![](images/IMG_2419.png \"IMG_2419\")](https://tapadoo.wpengine.com/wp-content/uploads/2011/05/IMG_2419.png)\n\nI was at the official press conference last week. At this the Irish Sports Council published their annual Anti-Doping report, launched new initiatives around education and unveiled this app. Certainly the app got a lot of the focus and was featured on the Six-One news. \\[caption id=\"attachment\\_714\" align=\"aligncenter\" width=\"480\" caption=\"Picutred are Dr. Úna May - Director of Anti-Doping, Michael Ring T.D., Minister of State at the Department of Transport, Tourism and Sport and John Treacy, CEO of the Irish Sports Council\"\\][![Press Launch of ISC Medications Checker iPhone App](images/511782-resized.jpg \"Irish Sports Council Publishes 2010 Anti-Doping Report\")](https://tapadoo.wpengine.com/wp-content/uploads/2011/05/511782.jpg)\\[/caption\\]\n"}},"__N_SSG":true}