{"pageProps":{"post":{"title":"Regular problem with XML to JSON Converters","date":"2011-02-22","content":"\nHere at tapadoo, we've done a number of apps which communicate with back end data servers. Typically this means a RESTful API with JSON or XML payloads. There's one issue we've come across on a number of projects, where we're dealing with an existing Web API which is presenting the payloads in JSON. The problem is where arrays are incorrectly serialized in certain cases. Specifically we've seen:\n\n- When an array has more than 1 entry, it is serialized correctly\n- When the array has only 1 entry, it is serialized not as an array, but as a single dictionary.\n\n**Firstly, lets explain why this has occurred** If you consider the following XML:\n\n<team>\n    <employee>\n      <name>Joe</name>\n      <surname>Bloggs</surname>\n  </employee>\n  <employee>\n    <name>Jane</name>\n    <surname>Doe</surname>\n  </employee>\n</team>\n\nA typical XML to JSON converter will convert this as follows:\n\n{\n  team:{\n    employee:\\[\n      {\n        name:'Joe',\n        surname:'Bloggs'\n      },\n      {\n        name:'Jane',\n        surname:'Doe'\n      }\n    \\]\n  }\n}\n\nI.e It is converted to a Dictionary, with a key called 'team' whose value is a Dictionary, with a key called 'employee' which is an array of Dictionaries (with keys of 'name' and 'surname').\n\nGreat. However if the XML was a team with a single entry:\n\n<team>\n    <employee>\n      <name>Joe</name>\n      <surname>Bloggs</surname>\n  </employee>\n</team>\n\nThe XML to JSON converter has no context on Employee. It has now way of knowing that this is potentially a repeating group (especially if it has no XSD to consult), so it converts the XML to the following JSON:\n\n{\n  team:{\n    employee:{\n      name:'Joe',\n      surname:'Bloggs'\n    }\n  }\n}\n\nSo, this is now a Dictionary, with a key called 'team' whose value is a dictionary with a key called 'employee' whose value is a Dictionary.\n\nThe problem here is when we go to parse, we expect the value of 'employee' to be an array (which it isn't), and this can lead to problems in the code.\n\nAnd..due to Objective-C loose approach to type, the following code will run: `NSArray *array = [teamDict objectForKey:@\"employee\"];`\n\nIn those cases where there team has a number of employees, the above code works fine, and the pointer, array stores an array. In those cases where a team as a single employee, the above code runs, however the pointer, array will actually point to a NSDictionary. So the following code (for example) `int numEntries = [array count];` Will sometimes work, and sometimes lead to a runtime error, which on iPhone will manifest itself as a crash.\n\n**So how do we fix this?** Well, if you have control over the server side, the simple question is to fix it in the first place. Note: This is a common problem with JAXB, a popular java XML binding mechanism often used in REST services written in Java. We've come across some examples on how to work around it [here](http://forums.netbeans.org/post-68036.html) and [here](http://jersey.576304.n2.nabble.com/Single-Element-Arrays-and-JSON-td5532105.html).\n\nIf you have no control over this, you may be able to handle this in your Objective-C code. Here's some sample code we've started to use; It checks the data type at runtime, and if necessary, converts it to a single element array\n\n+(NSArray \\*) getArrayFromJSONDictionary:(NSDictionary \\*)parent \n               forKey:(NSString \\*)key {\n  id obj = \\[parent objectForKey:key\\];\n  if(\\[obj isKindOfClass:\\[NSArray class\\]\\]) {\n    return obj;\n  }\n  if(\\[obj isEqual:\\[NSNull null\\]\\]) {\n    NSLog(@\"Warning: object for key %@ is null\", key);\n    // Return an empty array\n    return \\[\\[\\[NSArray alloc\\] init\\] autorelease\\];\n  }\n  NSLog(@\"Warning object for key %@ is of type %@\",\n        key, \\[\\[obj class\\] description\\]);\n  NSArray \\*ret = \\[NSArray arrayWithObject:obj\\];\n  return ret;\n}\n"}},"__N_SSG":true}