{"pageProps":{"post":{"title":"The Success of Toyota's App; FaceItDown","date":"2020-10-05","content":"\nThe ingenious [Toyota](https://www.toyota.ie) app, FaceItDown, has grown from strength to strength over the last number of years. We are very proud to be part of its success.\n\n### What is FaceItDown and how does it work?\n\nFaceItDown is an [iOS and Android app](https://tapadoo.com/case-studies/toyota-faceitdown/) that rewards drivers for not touching their phone while driving. You do as the name suggests ‘face it down’ for your entire car journey to earn points that you can redeem against certain rewards. \n\nThe app uses your phones GPS location tracking to track how many kilometres you have driven without picking up your phone. The phone must be left face down for the entire journey in order to receive the rewards. For each kilometre you travel without picking up your phone you will earn points. But if you pick your phone up mid-way you will lose out on the points you earned, so don’t pick it up!\n\nhttps://www.youtube.com/watch?time\\_continue=9&v=zLjHI4k5HZM&feature=emb\\_logo\n\nNote: Topaz has since changed to Circle K\n\n### How it came about?\n\n> “Driver distraction is thought to play a role in 20-30% of all road collisions. Driver distraction can include a range of in-vehicle distractions including eating, drinking, reaching for objects, dealing with children in the back seat etc but mobile phone use is thought to be a particularly significant distracting factor.”\n> \n> [RSA](https://www.rsa.ie/PageFiles/1879/Background%20to%20Driver%20Distraction%20(Mobile%20Phones%20and%20Driving).pdf)\n\nResearch conducted by the Road Safety Authority has shown that a driver is four times more likely to crash when making a call and 23 times more likely to crash when texting. \n\nIn light of Toyota’s brand slogan ‘built for a better world’ and the number of fatalities on Irish roads, Toyota came up with the idea for this app as a way of saving lives. They partnered with the Road Safety Authority (RSA) and FBD Insurance to deliver the product. \n\n### The Rewards\n\nDrivers are rewarded one point per kilometre and can use their points to claim various rewards.\n\nThere are currently three partners offering rewards, [Circle K](https://www.circlek.ie/), [FBD](https://www.fbd.ie/car-insurance/), and [Q-Park](https://www.q-park.ie/).\n\n350 points gets Any Hot Drink from Circle K, 1500 points gets the driver €50 off FBD car insurance, and Q-Park offer €2, €3, and €4 off parking when pre-booked online for 250, 400, and 500 points respectively.\n\n1500 might sound like a daunting number of points for a €50 discount off your car insurance, but let's say the driver lives in Wicklow Town and works in Sandyford, which is an 80km round trip. That driver will accumulate 400 points per week while on their commute. After just four months of safe driving, they'll have enough points for their discount.\n\n### The App\n\nWhen Toyota commenced the project they wanted a hybrid app and had initially approached an agency in New York, who commenced the app but ran into problems along the way. That’s when Tapadoo stepped in to help out. We took over the app, fixed the bugs and completed the project, and to this day have an ongoing relationship with Toyota.\n\nWe are advocates of native app development for many reasons, but taking on the FaceItDown project was an opportunity for us to get our teeth stuck into cross-platform development. You can read the experience our developer had while working on this project [here](https://tapadoo.com/native-app-development-or-cross-platform/). You should also read [Airbnb’s story](https://medium.com/airbnb-engineering/react-native-at-airbnb-f95aa460be1c) of why they moved from React Native to Native.\n\nYou can download the app on the App Store [here](https://apps.apple.com/ie/app/faceitdown/id1254020922) and Google Play Store [here](https://play.google.com/store/apps/details?id=com.toyotarsa.faceitdown&hl=en_IE).\n\n### The Overall Success of the App\n\nHere’s what users have been saying about the app on the App Store.\n\n> \"As a person who drives a lot, this app is right up my street. Only been using it a few weeks and I’ve had 5 free coffees.\"\n\n> \"I’m notorious for using my phone while driving and this has been a real incentive to put it down. I’m on my 10th free cup of coffee in 3 months.\"\n\n> \"Brilliant idea. My first day using the app and doing ok. As a person who was terrible at using the phone while driving it’s a great incentive. Well done and thank you, it was only a matter of time before I’d have been caught.\"\n\n> \"Just got my free coffee. Great initiative.\"\n\n> \"This is a great app. I’ve been using it for a few days and can’t really see a downside to it. Even before I got this app I never used my phone when driving, but now I get rewarded for not using it. I’ve gained 2 coffees so far. As a coffee drinker, it’s a great incentive.\"\n\n> \"I’m notorious for using my phone while driving and this has been a real incentive to put it down. I’m on my 10th free cup of coffee in 3 months.\"\n\nThe real success of an app is its retention rates. In other words, the number of people who download it and continue to use it after a certain period of time.\n\nHere’s how mobile app retention rates have looked over the last number of years. You can see that it dropped to 32% in 2019.\n\n![](images/Screenshot-2020-09-01-at-16.18.37-1024x649.png)\n\nBut different app categories have different retention rates. As you can imagine, gaming has one of the highest retention rates, while utilities has one of the lowest retention rates. On day 1 utilities have a retention rate of [23%](https://www.statista.com/statistics/523740/global-mobile-app-user-retention-rate-by-vertical/), this drops to [9% on day 2](https://www.statista.com/statistics/523740/global-mobile-app-user-retention-rate-by-vertical/) and [4.3% on day 3](https://www.statista.com/statistics/523740/global-mobile-app-user-retention-rate-by-vertical/).\n\nThe FaceItDown App has a staggering 81% retention rate since launch on the 31st July 2017. This is for Android only as Apple doesn’t share uninstall information. There’s also been a total of 28,772,805 kilometres driven safely since launch, split by 13,891,797 on Android and 14,881,009 on Apple.\n\nAnd a total of 48,128 rewards redeemed!\n\nIt's safe to say that the Toyota FaceItDown app has been a great success, not only in terms of the app but in making a real difference on Irish Roads.\n\nMaria Colgan  \nDigital Marketing Manager\n"}},"__N_SSG":true}