{"pageProps":{"post":{"title":"Twitter's changes: Thinking Ahead","date":"2012-08-17","content":"\nIt was reasonably late last night in Ireland when the [changes to the Twitter API](https://dev.twitter.com/blog/changes-coming-to-twitter-api) was announced. My initial reaction was similar I guess to [John Gruber's](http://daringfireball.net/linked/2012/08/16/twitter-drop-dead). I was concerned about what it meant to developers; I thought the matrix in the announcement was very \"un twitter\".\n\nBut I've since calmed. I don't hate it it that much. Yeah; Twitter won't be as great as before, but at then end of the day it will either be good enough, or not. I think I summarised it ok in a tweet:\n\nBasically\n\n<blockquote class=\"twitter-tweet\"><p>When the dust settles, if the experience of using twitter affects the benefits of using it I’ll stop using it. If it doesn’t, I won’t.</p>— Dermot Daly (@dermdaly) <a href=\"https://twitter.com/dermdaly/status/236258429688242176\" data-datetime=\"2012-08-17T00:29:33+00:00\">August 17, 2012</a></blockquote>\n<script src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\nI think its easier to drill into this with a few bullet points:\n\n- Twitter was never really about the user experience. People came to it for the _content_. Or more correctly for the **conversations**\n- Great clients like [Tweetbot](http://tapbots.com/software/tweetbot/) provide the great experience, but using tweetbot is simply a choice I make of a tool to access twitter by. It was never \"I like tweetbot so I should use twitter\" (that would of course be backwards)\n- Twitter are now trying to take control of the client experience, presumably to monetize it\n- They have to do this; without monetization twitter would fail, and we'd have no twitter anyway\n- The \"new twitter\" experience will presumably have ads and/or promoted tweets\n- Lots of users will hate this\n- More users (than the previous point) won't hate it, nor will they care\n- If the experience turns out to be terrible, people will stop using twitter if and only if getting off twitter is more acceptable than seeing ads\n- This is unlikely, as we really like the conversations we have there\n- Or more specifically, the larger general public won't leave because Beyoncé (or Justin Beiber or whoever) is still on it, and the main reason they are on twitter themselves\n\nIt strikes me that many earlier adopters of Twitter (say the first 5 million users) consider that they own twitter because they were around from the start. They where the ones who explained it to their friends, even when their friends were skeptical. But you don't own it. And, if it were to continue without appreciable revenue, it'll be gone anyway. So it is changing.\n\nUnfortunately, the changes are deeper to the seasoned twitterer than newer members. But hey - The seasoned guy is probably harder to advertise to and so forth.\n\nI think the group with the most legitimate gripe is the developers. Twitter was launched with a basic web site, and an API which allowed Twitter to say \"Knock yourself out - lets see what you can do\". And developers answered amazingly. There are great apps out there; and this undoubtedly meant that twitter could be available on every browser, desktop and mobile device with no development cost. Those developers did twitter a great service. They _are_ getting the two fingers from Twitter, and this is wrong. (Who's idea was the arbitrary \"200% from today\" crap anyway?)\n\nI think this has yet to play out more. It is a calculated risk by Twitter. It may yet get tweaked. I don't think Twitter will eat itself from within with crappy changes; If something is causing too much of a push back, they'll alter course.\n\nTwitter's making their omelette. We're seeing the inevitable breaking of a few eggs.\n"}},"__N_SSG":true}