{"pageProps":{"post":{"title":"Úll is nearly upon us","date":"2013-03-29","content":"\nAround October 2011, [Paul Campbell](https://twitter.com/paulca) pitched an idea to me. The conversation went something like this\n\n> I've an idea for a conference. It will be aimed at Apple Developers and Designers. I've even got a cool name for it. It's called Úll. I want you to help me.\n\nThat was about it. I knew Paul as we'd been through [Launchpad](http://www.ndrc.ie/launchpad/) together. Our desks were close by. We didn't talk software much, but I do remember lots of chats about [fine restaurants](http://www.thefatduck.co.uk).\n\nI liked the idea, so I agreed.\n\nOrganising Úll is like organising a large wedding; There's venues, meals, guests; Then there's speaker accommodation, entertainment and the logistics of making it all happen. It's scary, stressful and worrying during the process.\n\nAnd then Úll 2012 happened. Every speaker was amazing. Every social aspect was fun. All those words that are used so freely really describe it. Engaging, Entertaining, Enthusing, Inspiring, Enjoyable.\n\nThe line I've used to everybody since was \"It made me want to do my own job better\". But that only begins to describe it. It made me proud to be part of the iOS and Mac development community. I shared moments with great speakers and picked up stories. Úll will always have pride of place in my career highlights package.\n\nLooking back, many of my highlights were moments:\n\n- The night before the conference, sitting in a hotel bar with [Michael Lopp](https://twitter.com/rands), [John](http://twitter.com/gruber) & [Amy](https://twitter.com/AmyJane) Gruber, Paul, [Josh Clark](http://twitter.com/globalmoxie) and [Des Traynor](http://twitter.com/destraynor). People I've respected near and far, together just shooting the breeze\n- The look on Josh Clark's face when we entered the big ballroom for the banquet. He was gobsmacked\n- Seeing [Jim Dalrymple](http://twitter.com/jdalrymple) walk into the top floor of Odessa. It's a long walk up. Out of breath, all he can manage is \"What the fuhhh?\"\n- Baby Guinness shots with Amy Jane. Her idea.\n\nBut one moment stood out. After the last talk, Paul went up to the podium to thank the last speaker. You need to realise that at this point, we feel it's a good conference, but we genuinely don't know how well received it is. This is before Saturdays night's events, before the chill out on Sunday. So, there's still good stuff to come, but frankly, we're still nervous about if we've _actually_ pulled it off. And Paul asks\n\n> Was this worth doing?\n\nWhat followed was a standing ovation. I was stood at the back of the room. Paul had beckoned me up to the podium, but I didn't even hear that. I stood there and let that applause wash over me. I'm not exaggerating when I say it sent shivers down my spine, and had me welling up.\n\nYeah. It was worth doing.\n\nA week or two later, I met up with Paul again. \"So let's start planning 2013\".\n\nAnd now, [it's back](http://2013.ull.ie). What a line up. I literally can't wait.\n"}},"__N_SSG":true}