{"pageProps":{"post":{"title":"3 User Activation Rules in Mobile App Marketing","date":"2019-03-18","content":"\nUser activation is about getting a user who downloaded your app to become active in it. After all, you don't want your app to just sit on their phone with no interaction.\n\nThis is the case however for many apps that are downloaded. And if they aren't activated immediately after being downloaded they are deleted.\n\n[29.1%](https://www.apptentive.com/blog/2017/06/22/how-many-mobile-apps-are-actually-used/) of Android and [25.5%](https://www.apptentive.com/blog/2017/06/22/how-many-mobile-apps-are-actually-used/) of iOS phone users download an app and only allow it to remain on their phone for about a day before deleting it. So having a strategy for user activation is vital.\n\nLet's take a look at how important first impressions are for user activation.\n\n#### **Importance of first impressions for user activation**\n\n[81%](https://www.slideshare.net/Foolproof_ux/mconsumers-ethnographic-research-with-uk-mobile-consumers) of users say an app must make a good first impression.\n\n[49%](https://www.slideshare.net/Foolproof_ux/mconsumers-ethnographic-research-with-uk-mobile-consumers) have stopped using an app or mobile service because the login process was too time-consuming.\n\n[56%](https://www.slideshare.net/Foolproof_ux/mconsumers-ethnographic-research-with-uk-mobile-consumers) have not signed into their app because the registration process was too long or confusing.\n\n[72%](https://themanifest.com/app-development/5-best-practices-app-user-onboarding) of app users want the onboarding process to take a minute or less.\n\nThese stats are significant. They demonstrate the sophistication of users. They know what they want, so it's up to us to listen to them!\n\nSo how can you make a good first impression and activate new users?\n\nLet's take a look at the three golden rules of user activation below.\n\n#### 3 User Activation Rules\n\n#### **1\\. Onboarding**\n\nThe first and most important rule for user activation is your onboarding process. It's here that you get to make that right first impression.\n\nSo what is app onboarding?\n\nApp onboarding is about getting users familiar with your app; what it can do and the benefits they can expect from using it. And you should aim to show these benefits quickly. Users will only take a couple of minutes to look around, so you have a very short time frame to capture them.\n\nIf a user can't see the benefit of using your app immediately, they will dismiss it.\n\nYou've probably experienced this yourself. You download an app but the user experience isn't intuitive. You get frustrated, never use it or worse, uninstall. That app obviously didn't have a good user activation strategy.\n\nLosing a user is like someone unsubscribing from your mailing list. They are gone, never to return.\n\nAnd if you consider the cost of acquiring new users, it’s only right that the onboarding process be as sleek and sophisticated as possible.\n\nSo how do you achieve a good onboarding experience?\n\nPut yourself in your user's shoes.\n\n[Nancy Hua](https://blog.branch.io/want-mobile-growth-focus-on-user-onboarding/) from Apptimize says that every user will ask themselves three questions when opening an app:\n\n> Is this app trustworthy?\n> \n> Is it useful to me?\n> \n> Is it easy to achieve my goal within this app?\n\nYou can answer these questions with a good onboarding experience.\n\n#### **2\\. Communication** \n\nThe second rule with user activation is to have an effective communication strategy in place. Your communication strategy will cover everything from push notifications, in-app messages, the message centre, and the entire onboarding process. Consider your strategy in advance of the app launch and if possible, at the pre-development stage. Even a loose outline will help.\n\nIt can be difficult to consider a communication strategy at the development stage but it will help with the user experience. You can tweak it post-launch after observing user behaviour.\n\nAlso, having a communication strategy will prevent you from frontloading your guided tour if you choose to do one.\n\nThere are pros and cons to each form of communication within apps, but if you 'use - don't abuse' these channels they are great tools in your marketing tool kit.\n\n#### **3\\. Monitoring the Data**\n\nThe third rule is that you must monitor the data. The data plays a pivotal role in activating new users. And the two most important pieces of data to monitor are the onboarding data and retention rates.\n\nThe onboarding data can help with your communication strategy. You should apply your findings to your communication strategy. You can also use this data to personalise the experience, as you'll know when to engage with your user and what content to provide them.\n\nYou can then use this data to facilitate the user experience for activating future new users.\n\nYour app retention rates can show you at what point in the process users became dormant or uninstalled the app. Use this data to activate dormant users. And for the ones who uninstalled, you will know at what part of the process they did this, so you can decide if this is a pitfall with the onboarding experience. If it is, then you can rectify it.\n\n#### **Conclusion**\n\nThere's no doubt that mobile app marketing is a challenge. And each stage of the funnel presents a different set of challenges.\n\nBut if you focus on the user experience, the data and develop a communication strategy around this, you can be guaranteed a good level of success when activating new users.\n\nOur next blog post will focus on how to retain these users once you have activated them.\n\nAs this was part three of a five-part blog series you can read part [one](https://tapadoo.wpengine.com/mobile-app-marketing-planning/) and [two](https://tapadoo.wpengine.com/8-user-acquisition-tactics-app-marketing/) also.\n\nMaria Colgan\n\nDigital Marketing Manager\n"}},"__N_SSG":true}