{"pageProps":{"post":{"title":"Week 2 at Tapadoo","date":"2014-04-11","content":"\nWeek number 2 at Tapadoo, and I haven’t set the place on fire yet - I’d call that a success! I did accidentally lock the team out of a testing account for one of the projects we’re working on, but luckily we managed to reset it back pretty quickly! Other than that my time here so far has gone quite smoothly (the weekly cake day helps a lot!).\n\n[![tap-sign](images/tap-sign-1024x551.jpg)](https://tapadoo.wpengine.com/wp-content/uploads/2014/04/tap-sign.jpg)\n\nThe Tapadoo sign\n\nI was chosen as the iOS developer on the first day. I had meddled with Android development in the past, but never gotten the chance to try out iOS as I don’t own a Mac or an iPhone at home. This was the perfect chance to start!\n\nTo begin iOS development, I first had to learn Objective C. In college we focused primarily on Java and PHP and I’ve done a bit of Python in my spare time, but Objective C is quite different from them in terms of syntax, and so took a bit of time to get used to.\n\nI started off with a bug fix here and there for a project that is near completion, which was a really good way to get a feel for the standard I should be aiming for. It also allowed me to learn Objective C by reading the other developers’ code and trying to modify/add to it (without breaking it!). I spent the rest of my time buried in the Apple documentation!\n\n[![my-desk](images/my-desk1-1024x768.jpg)](https://tapadoo.wpengine.com/wp-content/uploads/2014/04/my-desk1.jpg)\n\nMy Desk (way better than Kevin's)\n\nAs Kevin (@[kpmmmurphy](https://twitter.com/kpmmmurphy)) mentioned in last week’s post, the development software took some time to get used to, in particular I keep forgetting to update a bug’s status when I’m working on it, but hopefully we will get more familiar with them as time goes on.\n\nEvery day we have a standup in the office, where each of us summarize what we’ve accomplished or struggled with that day. I think this is a great way to get to know what other people are working on, and what is involved in each project.\n\nOn Tuesday after work, the team went to an (@[Xcakelabs](https://twitter.com/Xcakelabs)) Xcake session which discussed the pros and cons of CocoaPods for iOS dependancy management. These types of events, combined with the occasional trip to a Sushi restaurant near the office make myself and Kevin really feel part of the team!\n"}},"__N_SSG":true}