{"pageProps":{"post":{"title":"App store optimisation;​ 5 ways to guarantee success in the app stores","date":"2019-07-15","content":"\nDid you know that there are almost [6 million](https://tapadoo.wpengine.com/mobile-app-marketing-planning/) apps in the app stores? You can see the exact breakdown per store [here](https://tapadoo.wpengine.com/mobile-app-marketing-planning/).\n\nWhile this presents a challenge, there are things that you can do to make your app stand out from the crowd. One way of guaranteeing your app being found is through app store optimisation.\n\nApp store optimisation is crucial for the success of your app. In the sea of apps, it will give your app a fighting chance of being found.\n\nApp store optimisation is optimising your product page listing in the app stores so that it appears at the top of the search ranks.\n\nThe app stores are a vital part of your [user acquisition strategy](https://tapadoo.wpengine.com/8-user-acquisition-tactics-app-marketing/). In fact, [47%](https://techcrunch.com/2014/10/03/roughly-half-of-users-are-finding-apps-via-app-store-search-says-study/) of iOS users discover apps through search on the App Store and [53%](https://techcrunch.com/2014/10/03/roughly-half-of-users-are-finding-apps-via-app-store-search-says-study/) of Android users discover apps through search on the Google Play Store.\n\nIf half of smartphone users find apps through search in the app stores, then you need to rank high in the app store search results. App store optimisation can help you do this. And done effectively, it can push you straight to the top of the search ranks.\n\nTake a look at the image below that shows how app store search is really effective for technology, travel and local apps.\n\n![App Store Optimisation. Image of graph showing how effective App Store search is for technology, Tavel and local apps.](images/Add-a-heading.png)\n\n[Source](https://think.storage.googleapis.com/docs/mobile-app-marketing-insights.pdf)\n\n#### App Store Optimisation Activities Impact Chart\n\nBefore we discuss the five areas to concentrate your app store optimisation on, take a look at the ASO Activities Impact Chart created by [ASO Stack](https://asostack.com/the-app-store-optimization-activities-impact-chart-51733504d95e).\n\nStarting in the right-hand upper upper quadrant, these activities will yield the highest return on your effort/investment by pairing high impact with low effort.\n\nThen move onto the top left quadrant when you have more time and resources. These efforts require more effort but will result in high impact. If you don't have time or resources skip the second quadrant and go straight to the 3rd best case quadrant. Doing this in conjunction with quadrant one will yield good results.\n\n![App Store Optimisation. ASO Activities Chart from ASO Stack.](images/Screenshot-2019-04-11-15.01.51-1024x828.png)\n\n[Source](https://asostack.com/the-app-store-optimization-activities-impact-chart-51733504d95e)\n\nWith this in mind, I have picked the top five things to focus your app store optimisation efforts on to guarantee the success of your app being found in the app stores.\n\n#### **1\\. Do competitor analysis**\n\nFirst things first, check on the competition. This may sound obvious but many app owners don't do this.\n\nBy checking out the competition, you get to see some great examples and some not so great. You are aiming to be the best, so you’ve got to know what’s currently the best in your category and go one step further.\n\nHave a look at the app name and the category they’ve listed their app in. Check out their icon, screenshots and app preview. Look at their promotional text and description.\n\nYou'll be surprised to notice apps that haven’t paid attention to this. Your listing is the shop window for your app. It contains the only piece of information users may read. It will be what they use to decide if your app will be downloaded or not.\n\n#### **2\\. Use Keywords**\n\nOnline marketers always talk about keywords and use of keywords is no different when promoting your app.  If you don’t have keywords you won’t be found, unless somebody is searching directly for your app. As John Koetsier [found](https://blog.branch.io/i-studied-the-top-500-app-store-keywords-so-you-wouldnt-have-to/), this generally only happens for big branded apps.\n\nYou can use keyword tools to help find the right keywords. [Keyword Tool](https://keywordtool.io/google) is a free tool or [Keyword Suggest](https://thetool.io/pricing) is a paid version. There are many other tools online that can help with keyword research. A tool we like here in Tapadoo is [Keywords Everywhere](https://keywordseverywhere.com).\n\nStart by building a list of keywords that users are searching for. Then use these keywords in your title and description.\n\nKeyword competitions is always a bone of contention. If you want the top keyword, you can guarantee your competitors want that too. [Straply](http://www.straply.com/) is an app store optimisation tool that provides insights to help boost your app store rankings. [MobileDevHQ](https://mobiledevmemo.com/mobiledevhq/) is another app store optimisation tool that allows you to analyse the performance of the keywords you are currently using in your apps description and to choose improved keywords. It also allows you to track your ranking in the App Store and Google Play over time, localised by region and based on search results.\n\n#### **3\\. Polish your marketing collateral**\n\nYour marketing collateral is made up of your title, description, promotional text, graphics such as screenshots, your icon, and video.\n\nTo ensure maximum downloads you need your marketing collateral to be effective. You can test its effectiveness through A/B testing each item.\n\nWith A/B testing you can test your app icon, title, description, screenshots and video. We spoke about this in a previous blog [post](https://tapadoo.wpengine.com/data-driven%E2%80%8B-decision-making-a-b-testing-in-google-play/). It's a really simple process and the Google Play Store has its own built-in tool for split testing. Apple doesn't have the same split testing built in.\n\nYour app icon is one of the first things users see and one of the main reasons for clicking through to your store. A/B testing your app icon can increase downloads by [30%.](https://android.jlelse.eu/app-icon-increasing-app-store-performance-by-30-f55a3d7d8de7)  \n\nInvest in each element of your marketing collateral to give your app a good chance of being downloaded. Use keywords throughout the text and make sure your icon and graphics are in line with the app brand. Your marketing collateral should look polished and professional.\n\n#### **4\\. Choose the right category**\n\nSpecify the right category and subcategory for your app. Your app will most likely fit into more than one category, so specify the primary category and the subcategory can help narrow this further. For example, if your app is a transport app, its category may be utility, which is broad. Ensure your sub-category is transport, which is a more targeted segment.\n\nThere are [24 app categories](https://blog.gummicube.com/2018/09/app-store-categories-are-you-in-the-right-category/) on the App Store and an additional 19 for games. And [36 app categories](https://blog.gummicube.com/2018/09/app-store-categories-are-you-in-the-right-category/) on the Play Store with an additional 17 for games. This is a lot to choose from. [Statista](https://www.statista.com/statistics/270291/popular-categories-in-the-app-store/) provides a useful chart on the most popular category on the Apple App Store. Here's how it looks on the [Google Play Store](https://www.statista.com/statistics/279286/google-play-android-app-categories/).\n\nStart by reviewing the apps in the categories you think your app should appear in. Don't overthink it. Go with what category you would naturally search for your app in. Apple provides a handy guide on how to choose the right category on the [App Store](https://developer.apple.com/app-store/categories/).\n\n#### 5\\. Ratings & Reviews\n\n[Brand advocates](https://tapadoo.wpengine.com/brand-advocates-mobile-app-marketing/) play an important part in your ratings and review strategy. A study from [Appentitive](https://go.apptentive.com/RatingsReviews.html) suggests that 77% of users will read at least one review before downloading an app. And 65% are likely to leave a review after a negative app experience. The good thing about ratings and reviews is that [64%](https://go.apptentive.com/Feedback-Loyalty-On-Mobile-Frontier.html) of consumers prefer to leave feedback in-app and [98%](https://go.apptentive.com/Feedback-Loyalty-On-Mobile-Frontier.html) of app customers are likely to give feedback when asked.\n\nAccording to [Apple,](https://developer.apple.com/app-store/ratings-and-reviews/) ratings and reviews influence how your app ranks in search results, and can affect whether someone downloads your app. Individual ratings inform your app’s summary rating, which is displayed on your product page and in search results.\n\nAsk users to rate and review your app at an appropriate time i.e. when the user has used the app a few times and they are more likely to be satisfied. Asking a user to rate an app after one use is contrary to a good user experience and may result in a negative rating and review. Likewise, interrupting a user mid-way through their experience is a cause for a bad review.\n\nBottom line, [96%](https://www.apptentive.com/blog/2015/05/05/app-store-ratings-reviews-guide/) of users would consider downloading an app with a 4 star rating and [33%](https://www.apptentive.com/blog/2015/05/05/app-store-ratings-reviews-guide/) of users read 7+ reviews. This is common sense. You know yourself that you will only download an app with positive reviews and ratings. Reviews are probably the single biggest influencing factor on app downloads in the short term.\n\n#### Conclusion\n\nFocus your app store optimisation on your icon, title, keywords, ratings and reviews. [A/B test](https://tapadoo.wpengine.com/data-driven%E2%80%8B-decision-making-a-b-testing-in-google-play/) each element to see what has the maximum amount of impact and watch how you increase your chances of being found in the app stores.\n\nMaria Colgan\n\nDigital Marketing Manager\n","categories":["marketing"],"tags":["app-categories","app-search","app-stores","keywords"]}},"__N_SSG":true}