{"pageProps":{"post":{"title":"U2 were the absolute right band for Apple to give away an album","date":"2014-09-11","content":"\nAt the end of Apple's big announcement on Tuesday night (our time), Apple announced that U2's latest album was been given away to every iTunes customer for free. A whole album. For free. For everyone.\n\nThat's huge.\n\nAnd subsequently, Bono has written [a blog post about it](http://www.u2.com/news/title/remember-us), explaining how it was a gift from Apple. Essentially U2 were paid for every copy (at I'm sure, a discounted price, but a guaranteed one nonetheless).\n\nAnd of course out came the haters. The told us U2 are no longer cool, don't resonate with the audience, etc. etc. Heck Bono even had a jibe:\n\n> And for the people out there who have no interest in checking us out, look at it this way… the blood, sweat and tears of some Irish guys are in your junk mail.\n\n**The haters are wrong and here's why:**\n\n- No matter who you pick, you'll always have someone who doesn't like their music, and will be vocal about it\n- So it make sense to go with the most popular acts across your entire customer base; If you pick someone less popular, you have, by definition more people to disappoint\n- Apple have a stunning amount of data on music sales. So when someone in marketing says \"Who's the biggest band we could use to gift an album\", there's someone who can run a query and come back with a list of top-sellers\n- Taking a guess at who'd be in that list, I'm gonna say U2 were firmly in there. Like them or hate them, they're one of the biggest selling bands of all time\n- Unfortunately, many of the bigger sellers are no longer with us (Think Michael Jackson and Elvis)\n\nThe timing was great too: U2 were working on a new album, it seems like a great choice to me.\n\nThey could have given us a Justin Bieber album or A One Direction album. But would that lead to less uproar?\n\nPicture credit: [Matt McGee](https://www.flickr.com/photos/pleeker/76676872/in/photolist-7LZn3-76Tp2K-2aRaT-iLApt-kBX48K-6Ba1fG-a8DEK-a8DEM-5jn3MX-5USUVk-3WxAt-HXyL-7VPHzu-HXyQ-HXZj-HYjV-HXVf-gPScC-3WxDj-8ufnr-6MA8dL-9RJFxz-6Q7Axo-czEXu-Jhsu-6DYCN1-HXyK-HXyN-6Q7nt1-6Rwnry-HXyP-75FUZF-HXVa-bA8nCg-9eNS7T-HXZe-3494sG-bA8nCz-6RsiY2-jrnpV-7LZn1-6Rwnzo-344tYn-c1XG5m-6RwnCU-HXZf-HXyM-aTg6j-HYHj-i3FCL)\n","postImage":"https://2upm2b1wdft320vzjj34rpga-wpengine.netdna-ssl.com/wp-content/uploads/2014/09/76676872_8312c76522_o.jpg.webp"}},"__N_SSG":true}