{"pageProps":{"post":{"title":"The iPhone killer is on the way","date":"2010-02-16","content":"\nThe new windows 7 phone is upon us. Finally there's an \"iPhone killer\"!!!\n\nEhhhhh. No.\n\nThere will be an iPhone killer. But it's not going be today tomorrow. The iPhone is just far too advanced of any competition.\n\nWhy? Apple have one thing _in spades_ that no other computer or handset manufacturer has: **Taste.**\n\nThis seems to be lost on most non-iPhone owners. The arguments for the competition are usually about specifications. That's just silly. Most people don't know _megabytes_ from _kilohertz_ so don't give a monkeys about specifications. I've often listened to arguments about x device having a faster processor, or doing background processing. But these people never ever do what almost every new iPhone owner does : tell me how much they love their phones. **Try it**: borrow a buddies iPhone and play with it. 2 things will happen : you'll say \"yeah...it is lovely\" and your buddy will start to twitch; we don't like letting our iPhones out of our reach for too long. You don't get that reaction from a new Sony Ericsson, Nokia, Samsung or Android for that matter. In fact the most common utterance I hear from nokia owners are\n\n> \"look I just want to make calls and send texts\"\n\nnot\n\n> \"I love this phone\"\n\nEvery time I try out a new other vendors phone I usually finding myself not liking it. sometimes the annoyances are subtle like just _slighlty_ too slow to respond or jerky scrolling. That just tells me that someone in the company, high up, with the final say said\n\n> **\"it's good enough.\"**\n\nThat's understandable; getting the last 5% so that something goes from \"good enough\" to \"perfect\" may well take ages or cost the earth. But thankfully, Apple don't do \"good enough\". They take the \"it's gotta be perfect\" approach as a matter of course. And for that...we have the iPhone\n\nSo when's that iPhone killer coming? Consider this: for a few years, every new mp3 player was being dubbed an _\"iPod killer\"_. It hasn't happened yet and nobody even writes about iPod killers anymore.\n\nSo far the only iPhone killers have been, well...newer iPhones.\n\nIt won't last forever; it never does. Walkmans were toppled; iPhones will be, but it will take new technology that I can't imagine right now. iPhone could easily dominate for a decade......\n","categories":["business","iphone","iphonedev"]}},"__N_SSG":true}