{"pageProps":{"post":{"title":"A Corkman Abroad","date":"2015-04-23","content":"\nHello everyone. My name is Conor and I am the other new Tapadoo employee from UCC. I’ve been here over a month now and managed to maintain radio silence up until this blog post. I thought however that it was well past time for me to say hello.\n\nComing to Dublin was almost like a bit of culture shock to me. I grew up in a very, very small village half an hour outside of Cork City so moving to the capital was a big change. Before moving here I’d only been into Dublin city a handful of times. Most of which were in the previous few months to sort out accommodation. I went from dreary car journeys into Cork city to a daily 8am Luas Journey in a matter of days. \n\nBut enough about that. What I’m really here to talk about is working with Tapadoo, and where do I even start? From the very first day I was welcomed and treated like one of the team. I came into a fantastically positive atmosphere and it really helped getting over the initial nervous ‘new guy’ slump.  During the first few days we were given a breakdown of the projects we would be involved in. It felt incredibly humbling to be trusted with such tasks so soon, and of course, a little daunting.\n\nIn the end the first week was everything I needed to get settled in. Help was around whenever it was required, and there were no shortage of people giving it.\n\nA week or two later was the famous Úll conference. I was heading down with Emily to volunteer at the conference. I didn’t know what to expect initially. I’d never gone to a tech conference before, my experience had come from watching E3 every year on the internet. Not exactly a bragging right. When it came down to it though it was an outstanding opportunity. I met so many new people and got to spend time outside of work with my new friends from Tapadoo. I don’t think there are enough words in my vocabulary to express just how thankful I am to Dermot and Sasha for the experience. \n\nIn between Úll and now I’ve been getting up to speed with new projects and skills. Coming into Tapadoo most of my programming experience had been at an academic level for tests and assignments. Now I’m working on  projects and already I feel I have built upon my existing programming knowledge tenfold to what it had been before. \n\nI'm a big fan of the weekly cake days, although I say that full knowing in a few weeks it will be my time to shine and I will wish I'd have done home economics back in secondary school. I’m really looking forward to the coming months and I'm very excited to see what the next weeks will bring.\n\nImage Credit: [William Murphy on Flickr](https://www.flickr.com/photos/infomatique/)\n","postImage":"https://cdn-bhcgp.nitrocdn.com/lQsUIlYWTGkhjqgYKmLJkHSBczAwGDPM/assets/static/optimized/rev-f8d7f54/wp-content/uploads/2015/04/Cork.jpg.webp"}},"__N_SSG":true}