{"pageProps":{"post":{"title":"Why App distribution policy could be bad for iPad","date":"2010-03-01","content":"\nI see lots of people thinking of great ideas for the iPad. I agree with pretty much all of them. Anywhere where there's a person carrying a handheld device, or indeed a notepad an pen, could be a potential application. Here's a few examples\n\n- Waiter taking orders at a table\n- UPS Delivery guy\n- Gas man coming to take a reading\n- Charity worker - getting sign-ups but also using the multimedia capabilities to show where the donations are going to good work\n\netc. etc.\n\nRight now, there are three ways to distribute iPhone apps:\n\n1. The App Store - This is designed for general purpose apps that anyone may want to use\n2. Enterprise Distribution - This is designed for \"in house\" only apps. This is where a company wants to supply apps for their staff use only, and not put them on the app store.\n3. Ad Hoc Distribution - This is where a developer can distribute the apps privately to a group of people. It is primarily aimed at developers who want to get real-world feedback before really releasing the app through 1 or 2 above\n\nWhen we consider that some of the app ideas (e.g. the waiter concept) is really an \"in house\" app. But each of the distribution mechanisms has its drawbacks:\n\n- You may not want to put it in the app store, because it only works with your restaurant management system.\n- You'll not qualify for Enterprise distribution, because Apple restricts this to companies of 500 employees or more\n- You could use ad-hoc, but this does take a fair bit of management for the developer. The developer needs to know each and every device id that the app will be installed on (and has a limit of 100 slots per year; which cannot be re-used during the year).\n\nNone of these are insurmountable, but they are niggles. Basically, there isn't a simple way to distribute \"private\" apps. This is by design; It is a commercial decision by Apple. If there was a way, people would use it to bypass the app store (to avoid the apple cut), so its unlikely to change.\n\nOne thing it could lead to is an explosion of \"new\" software as a service offerings. Consider the \"menu ordering\" SAAS system; The restaurant signs up online, and enters their menu details. The Menu Ordering App is sold through the app store, and the restaurant simply enters their restaurant id and password when they use the app for the first time. This could work, but its a big education job to explain SAAS to restaurant owners.\n\nI think all of those who want to put iPads into their businesses will find the distribution options confusing and consider it a hinderance.\n\nThat's a challenge for us developers.\n\n* * *\n\nYou're reading the tapadoo blog. Did you know that as well as publishing our own applications, we offer iPhone development services and consultancy? If you have an idea, project or something you think we can help you with, please get in touch through [our contact page](https://tapadoo.wpengine.com/contact/).\n","categories":["business","ipad","iphone"]}},"__N_SSG":true}