{"pageProps":{"post":{"title":"Was announcing a $999 stand a mis-step? I think so","date":"2019-06-06","content":"\nWWDC is a special place for me. I first visited in 2009, and went to every one between 2011 and 2017.\n\nIt starts with the keynote, which is where Apple tells us what's coming in iOS, MacOS and usually some new capabilities or tools is it making available for developers.\n\nIt used to also be where they'd announce new hardware; I was there for the announcement of the iPhone 3GS, Retina Mac Book, Better MacBook Airs, to name but a few.\n\nOne thing I've got used to is the reaction of \"normals\" to WWDC. Each year I come back, and someone who doesn't work in App Development, or doesn't own a Mac usually says something like \"I heard Apple did X\", where X is a derivative of an announcement. \"I heard apple cancelled an iPad\" may be a derivative of Apple revving the entire line up, dropping some prices, and quietly cancelling the lowest end model.\n\nI get it, subtleties can't really be portrayed in an article or news snippet; Sometimes I find myself trying to explain it, but I just come across as a pure fanboy.\n\nIn recent years, the hardware announcements have taken a back seat in favour of announcing software updates, and new developer tools. I caught the collective gasp of surprise when Apple announced Swift in 2014 in a year we all said \"This was about the developers\".\n\nAnd this week, developers are happy with the announcements - SwiftUI looks like the foundation for all future apps, and will ease bringing them to the Mac. Simpler ways to animate and a standardised set of symbols, much simplified encryption are just a taste of what's to be welcomed.  \n\nThe new Mac Pro, and the XDR display are indeed very, very impressive pieces of kit. But here's the rub: They aren't something that you or I need. They aren't something that a developer needs. These are truly aimed at specific tasks that are very niche: Professional Photography, Video editing and audio composing/editing.\n\nSo, why launch a high-end workstation at a developer conference at all? Here's what I think:\n\n**The crowd will love it**. Because we're developers and high end specs impress us. But, I'd be surprised if 1% of the audience will purchase one. Remember, A standard MacBook Pro is very capable of running XCode.\n\n**There's no other logical time to announce it**. Is it too niche to have it's own event? I'm not so sure about this, as each year the iPad announcements have tended to be about \"the creators\". Perhaps the iPad announcement is a better time to talk about the new Pro equipment. Of course, maybe Apple like that the iPad event is _just_ about the iPad.  \n\nSo why is everyone talking about at $999 Monitor Stand ?\n\nWWDC is a real marquee event for Apple. This means all of the news outlets show up. To give you an idea: The outside is surrounded by Satellite Dishes, there's a massive section filled with news cameras, and the Irish Times and Irish Independent typically fly over a correspondent. Everything Apple say in the keynote will be reported on, analysed, and distilled to bite sized pieces.\n\n$999 for a monitor stand is ridiculous. Or at least, out of context it is ridiculous. It's the perfect \"look how crazy Apple have got\" kind of tidbit, that will work great in a news article, or a 30 second news radio slot.\n\nThe subtleties that Apple have just undercut significantly the pro monitor market are always going to be lost. Most normals see Apple as a high-end consumer brand. They do not think of it as a brand which has always been the only computer you'd see in a professional studio, or a brand on every desk in Pixar. Nobody will realise they are competing with monitors in the $20,000-$50,000 price range.\n\nYesterday I spoke to some normals, they were asking me about the new MacBook Air I had with me. And one of them mentioned \"I heard Apple announced something weird, was it a new monitor ? or a stand or something?\"\n\nAnd that's when I realised: Announcing a $999 stand was a mis-step.\n","postImage":"https://2upm2b1wdft320vzjj34rpga-wpengine.netdna-ssl.com/wp-content/uploads/2019/06/Apple_mac_pro_new_display_final_cut_screen_060319.jpg.webp"}},"__N_SSG":true}