{"pageProps":{"post":{"title":"A look at WWDC 2016","date":"2016-07-06","content":"\n### **World Wide Developer Conference 2016**\n\nThe Apple World Wide Developer Conference (WWDC) has finally arrived. The annual event is used by Apple to announce and showcase their latest products and technologies. It's the biggest Apple event of the year, watched by millions of fans and developers around the world, and we here at Tapadoo are no exception.\n\nThis year’s conference was devoted to software. We were presented with powerful updates to iOS, tvOS, watchOS, and the newly named macOS Sierra among other technologies.\n\n[![ios10](images/ios10-300x169.jpg)](https://tapadoo.wpengine.com/wp-content/uploads/2016/07/ios10.jpg)\n\n**iOS10**\n\niOS10 presented us with some impressive upgrades. Cool new features such as raising your wrist to “wake up” your phone are making interaction with your smart devices seamless and elegant.  The redesigned lockscreen with its rich notifications and use of 3D touch mean you can do much more without ever having to unlock your phone and dig through apps.\n\nOne of the most exciting aspects of iOS 10 is third party integration with Apple default apps and services like Siri, iMessage and Apple maps.\n\nIn the iOS10 iMessage app this will allow you to use other apps from within your conversations. You will be able to do things like order food, buy concert tickets or even send money using iMessage compatible apps.\n\nThere will be a “mini” app store built into iMessages allowing users to browse iMessage apps or “extensions” and install them from within the app.\n\nWith the new Siri SDK developers will be able to build Siri support into apps. This will allow tasks to be performed like asking Siri to send a message in WhatsApp.\n\nFinally, prepare to be amazed. In iOS10 emojis have been revolutionised. With predictive emojis, the ability to convert words into emojis, and emojis that are three times bigger - we have truly made a leap into the future.\n\n :P\n\nBut really, things are looking very good for iOS 10 and I’m looking forward to its full release.\n\n[![watchOS3](images/watchOS3-300x169.jpg)](https://tapadoo.wpengine.com/wp-content/uploads/2016/07/watchOS3.jpg)\n\n**WatchOS3**\n\nThe main focus of watchOS this year was speed. The watch has experienced some serious increases in performance and speed that allow you to access your favourite apps much quicker and navigate more efficiently.\n\n[![macOs](images/macOs-300x169.jpg)](https://tapadoo.wpengine.com/wp-content/uploads/2016/07/macOs.jpg)\n\n**macOS Sierra**\n\nOSX has received major updates and has been renamed macOS. The first release will be called macOS Sierra. Some interesting additions include bringing Siri to mac, the ability to store old files in the cloud, and auto unlock with the apple watch. macOS seems very promising and I’m looking forward to how it develops in the next few years.\n\n[![tvOS](images/tvos-300x169.jpg)](https://tapadoo.wpengine.com/wp-content/uploads/2016/07/tvos.jpg)\n\n**tvOS**\n\nSiri on tvOS has been improved. You can topic search for movies, youtube search and tune in to live channels using Siri.\n\nA new iOS remote app for tvOS has been created, replacing the outdated technology of a physical remote control, and reducing the chance for arguments over who lost the TV remote. This amalgamation of technologies brings us closer to being able to control every aspect of the home and daily life with our smart device.\n\n[![homekit](images/homekit-300x169.jpg)](https://tapadoo.wpengine.com/wp-content/uploads/2016/07/homekit.jpg)\n\n**HomeKit**\n\nThis brings me on to one of my own interests, and my favourite part of the conference this year. Improvements to HomeKit.\n\nHomeKit now has an app in iOS10 which allows you to control and interact with your HomeKit enabled accessories and sensors. With Siri integration, you can control your accessories and appliances simply by talking to them. Advances in technology like this are particularly interesting to me and I hope to see more work done with HomeKit in the near future...\n\nThis has only been a brief look into the announcements and exhibits held at this years conference. It was jam packed with progressions in Apple technologies and it has me excited to see how things have changed this time next year.\n\nThanks for reading and make sure to check out [Stephen's blog](https://tapadoo.wpengine.com/2016/my-thoughts-on-io-no-9/) on Google’s WWDC equivalent “ I/O” to get a comparison on the respective companies objectives and ambitions.\n\nUntil next time!\n\n_\\-Darragh_\n","postImage":"https://cdn-bhcgp.nitrocdn.com/lQsUIlYWTGkhjqgYKmLJkHSBczAwGDPM/assets/static/optimized/rev-f8d7f54/wp-content/uploads/2016/07/Screen-Shot-2016-07-06-at-16.34.58.png.webp"}},"__N_SSG":true}