{"pageProps":{"post":{"title":"6 things every CIO must know before outsourcing their enterprise app development","date":"2019-04-29","content":"\n[Gartner](https://www.gartner.com/en/newsroom/press-releases/2015-06-16-gartner-says-demand-for-enterprise-mobile-apps-will-outstrip-available-development-capacity-five-to-one) has said that the market demand for enterprise mobile apps will grow at least five times faster than internal IT organisations’ capacity to deliver them.\n\nTheir lead research analyst, Adrian Leow, said enterprises find it a challenge to rapidly develop, deploy and maintain mobile apps to meet increasing demand, as it is exceedingly difficult and costly to hire developers with good mobile skills.\n\nHence the reason why enterprises are turning to external partners to develop their apps. But finding the right enterprise app development partner can be a challenge in itself. So we’ve put this quick guide together to help with your decision-making process. It explains what you need to consider before outsourcing the development of your enterprise app.\n\n#### 6 things to consider before outsourcing your enterprise app\n\n#### 1.Enterprise App Strategy\n\nAs CIO, your main goal is to find a development partner who understands strategy and in particular, enterprise app strategy.\n\nYour development partner should take the time to understand your business needs and decide how best to bring benefit to the process. You’ll want your partner to challenge your assumptions but support your overall decisions.  \n\nYou'll naturally have a number of questions at the outset of your enterprise app development project such as those below. The app development partner should be able to answer all of these questions comprehensively. In doing so they should advise if an app is the right strategy for your business and how best to achieve this.\n\n> Do we even need an app?\n> \n> How can it benefit our business?\n> \n> Where do we start?\n> \n> How much will it cost?\n> \n> Are there security concerns with putting our data on mobile devices?\n> \n> How do we protect our data?\n> \n> How do we distribute apps to just our team?\n> \n> What's the process for developing an app?\n> \n> Can we build for just one platform?\n> \n> Is there a cross-platform way we can develop?\n> \n> How do we integrate with our existing systems?\n\n#### 2\\. The Right Team\n\nDeveloping an enterprise app doesn’t just require the skills of a developer. An app also requires considered user experience design, graphic treatment, testing and project management. Understanding that it goes beyond “just programming” is key to success.\n\nThis is often one of the reasons why enterprises make the decision to outsource their enterprise app development. Employing these resources in-house can be a costly endeavour for the enterprise, particularly if these resources are better used elsewhere.  \n\nLook for the following with your app development partner:\n\n> A project manager with excellent communication skills, who also understands the industry and business of mobile app development.\n> \n> A UX designer whose focus is on mobile. A great web person may not understand the subtleties of mobile app navigation, nor the subtle differences in navigation between iOS and Android.\n> \n> Developers with a passion for their platform. Developers tend to be either Android developers or iOS developers. Some do both, but generally, developers like to stick to their preferred platform. Look for developers who care about the importance of navigation, making tasks simple and working to the UI guidelines provided by Apple or Google.\n> \n> When it comes to QA, you’re looking for an attitude. QA is a subtle skill, not fit for everyone. As our QA lead Rita says:\n\n> “Our QA approach is not just confined to testing. It is a mindset, a culture, that continually views quality as our primary goal. We are sanctimonious advocates of app quality assurance. The success of your app means everything to us”.\n\n#### 3\\. Stringent Process\n\nYour development partner should have a well-defined development process, and should be able to articulate this well. The process should go from idea through to after-launch care.  Expect them to cover idea development, business requirements, and strategy. Also user experience design, user interface design, development, QA, release and support.  \n\nEach part of the process is as important as the next. You want a company who demonstrates proficiency and skill at each step of the process.  \n\nAsk yourself:\n\n> Can this company take your enterprise app idea from strategy to ongoing maintenance and support and cover every step in between?\n> \n> Can they counsel you on what parts of your business will lend themselves to an app and where an app is not the answer to your needs?\n\n#### 4\\. End to End Support\n\nYour enterprise app may well be part of a large ecosystem and may need to be integrated with these systems.\n\nYou developer may need to integrate directly with these internal systems, utilise existing APIs, or develop new ones. Or they may need to work with your internal teams so that they can integrate with the internal systems.  \n\nIn the event of the app not working, you’ll want to work with a developer who can diagnose where an issue may be. It could be in the app, some custom middleware, or your internal system. Supporting this will need a partner with a “can-do” approach, and an ability to liaise with your internal teams for support issues.  \n\nYour chosen partner may need to develop the app, or the solution, or a mixture of both. You may want to look at a solution that avoids change to internal systems and doesn’t require too much internal development.\n\n#### 5\\. Upfront About Costs\n\nA pricing structure should be offered in a way that suits you. You don’t want any hidden costs lurking around the corner. And you certainly don’t want to be told that your project will cost X only for it to turn out to be Y because other requirements have been added if the project scaled.  \n\nMany companies offer a fixed price project. This type of pricing structure doesn’t lend itself to a project that may require changes during its development. Therefore if you sign up to this type of pricing structure and your project changes midway, you are going to incur extra costs.\n\nMaybe your business is fine with this but if it’s not, then you need to consider is this the best type of pricing structure for your project.  \n\nYou should also consider what other types of pricing structures the development company offers.\n\n#### 6\\. Code Best Practice\n\nAny code that is developed solely for your enterprise app should belong to the enterprise but check this with your app development company.\n\nAsk them if they will use a third party open source code for any part of the development or in-house reusable elements and how this effects your enterprise app.  \n\nHow the code is revised is also important. Can programmers check directly into source code trees or are all checks via a pull request mechanism?\n\nBest practice is through a pull request mechanism so each change is code reviewed. While this doesn’t lead to zero bugs, it reduces the instance of bugs and ensures that less experienced developers benefit from more experienced ones.\n\nAsk your development company what systems they use to analyse code and how warnings and errors are treated.\n\nI hope this post goes some way towards helping you with your decision-making process and securing the right development partner for your enterprise app.\n\nMaria Colgan\n\nDigital Marketing Manaer\n","postImage":"https://cdn-bhcgp.nitrocdn.com/lQsUIlYWTGkhjqgYKmLJkHSBczAwGDPM/assets/static/optimized/rev-f8d7f54/wp-content/uploads/2019/03/architecture-blur-bridge-266044.jpg.webp","categories":["business"],"tags":["cio","enterprise","outsourcing"]}},"__N_SSG":true}