{"pageProps":{"post":{"title":"Can paid ads in social media help recruit great talent?","date":"2012-02-28","content":"\n**Guest Blog Post by John Dennehy, Zartis.**\n\nZartis is a social recruiting tool to help growing companies attract and hire great people; Think of us as a talent magnet.\n\nWe’re constantly trying to find creative ways to help high tech companies grow their teams. So paid ads on LinkedIn and Facebook often comes up in conversation.\n\nThe attitudes run something like this:\n\n“You’re in LinkedIn and probably thinking about your career so it’s a good time and place to get someone’s attention.”\n\n“I’ve never clicked on one of those ads.”\n\n“The jobs displayed in LinkedIn definitely get your attention.”\n\nAs the saying goes: “I know half of my advertising budget is wasted, but I’m not sure which half”. Pay per click helps answer that, so we ran a simple test.\n\nWe created a Facebook ad for a freelance writer. After segmenting the audience by geography and demographics there were about 20,000 people in the target audience.\n\nBecause I’m writing this you can probably guess that we didn’t find our writer.\n\nWe created two variants of the same ad as a simple A/B test. The ad was seen by about 4,000 people, on average 5 times in one week. Four people in total clicked through. None applied for the job. Maybe I write lousy ad copy. It was pretty disappointing. We know Facebook can work extremely well for job referrals. See here for a quirky case study.\n\nTotal cost of experiment $1.60. Teacher’s comment: “Needs more practice.”\n\nNow, one our customers, Tapadoo, is looking for a mobile app developer. That’s one of the hardest roles to fill pretty much anywhere in the world right now. We tried to help by creating a LinkedIn display ad campaign.\n\nThe job had already been tweeted by some high-Klout individuals. There were about 300 page views generated from the twitter traffic. But no applicants yet.\n\nWe set the ad to a target of 26,853 people, based on the very granular segmentation offered by LinkedIn. Two variants were created for A/B testing. In one day there were 17,189 impressions and 4 click throughs resulting in one applicant.\n\nTotal cost of experiment $11.03.\n\nWhat does this tell us? Not a huge amount sadly because our R&D budget is so low. The laws of small numbers are dangerous.\n\nIf we stretched the numbers and spent $1103 buying 400 LinkedIn click throughs would we have got 100 applicants? That could potentially be very powerful.\n\nIf you’re reading this with £10k burning a hole in your pocket let me know and we can find which half is not wasted.\n\n \n\n**From Dermot, Tapadoo:**  By the way, the job is still open.  So if you're interested in working with a great mobile app development company; [go take a look here](https://my.zartis.com/tapadoo/jobs/1459/mobile-apps-developer-dublin)\n","categories":["business"]}},"__N_SSG":true}