{"pageProps":{"post":{"title":"Engaging your users - The holy grail for iPhone Applications","date":"2009-09-23","content":"\nWhen you launch an iPhone Application, you put it up on the iTunes App store. If you're lucky it will be purchased by users. If you're very lucky, they'll give it good ratings, and if you're very very lucky, the'll add favourable reviews.\n\nApple will share with you download and sales figures, but you will have no real way of contacting those users - Apple don't give you, for example, the email addresses of your users; Which is perfectly understandable; they may have downloaded your app, and immediately deleted it. They aren't _your_ users, they're _Apple's_ users. Apple, understandably wouldn't like iTunes users getting spammed by people who wrote the apps.\n\nThis does lead to a disconnect though; How do you engage with your users? The people who use your apps regularly are the same people who can give you the best feedback. I've done one or two of these, and need to do more (\"A lot done, more to do\" as the phrase goes). But here's my thoughts\n\n1. **Read your reviews**. Some people will give useful feedback here. Read them all. Go over them, regularly\n2. **Provide a _number of channels_ to take feedback**. My page about \"[Irelands Phone Book](https://tapadoo.wpengine.com/iephonebook)\" and \"[Irelands Phone Book Pro](https://tapadoo.wpengine.com/iephonebookpro)\" has a UserVoice feedback tab at the side of the web page. It allows users to submit feedback directly; I take comments on my blog, and reply to them all, and I also publish my e-mail address on the site.\n3. **Allow for feedback within your app** I fell down on this one. But the 3.0 SDK now allows for embedding emails, so allow the user mail you direct with feedback. All my future apps will do this.\n4. **Get yourself a bug/issue tracking system**. Any useful feature requests, put them in there for your next version. Also to record where you got the request\n\nPeople will have gripes or dislikes about your app. Its how you choose to deal with them that is important. By taking it on board, you can turn an estranged user into one of your biggest supporters.\n\nAlso, if you do act upon user suggestions, its a good idea to let the user know that you've implemented _their_ feature request.\n\nAnd with that, I'd like to thank the following. All of you had influence on deciding what to put into [Irelands Phone Book, Pro Edition](https://tapadoo.wpengine.com/iephonebook):\n\n- User **Nabidana** on iTunes: You asked for SMS directly through EirText Pro. You got it. I also added support for EirText (free) and JellySMS.\n- User **Wez77** on iTunes: You asked for mapping. That's there now too.\n- Twitter User : **@mejooley**: When you heard I was adding maps, you said \"Will I be able to get directions?\" - Well, that would be complicated..let me see..OK; You can tap on an entry in the map and it will open it the iPhone Maps application. Now you can get directions.\n- **Dan Laffan:** You said you didn't like when you use the previous and next page buttons, that the table remains at the bottom of the results - Like, If I hit next page, surely I want to see the top of the next page. Yup. Agreed. Done.\n- Twitter user **@conorwinders**. You asked for better integration with contacts.app. I've done some of it (more to come), but now you can either create a new contact, or save the contact to an existing one.\n- **Tom Fennelly**: You suggested being able to override the default search location. You even suggested the concept of \"name@town\". That's a great idea. Good for users, and really easy to add. So I did it. Its in there.\n\nOn the off-chance you've not read the [main page about the pro version](https://tapadoo.wpengine.com/iephonebookpro), here's an [App Store link](http://itunes.apple.com/WebObjects/MZStore.woa/wa/viewSoftware?id=330042465&mt=8&s=143441) (Opens in iTunes).\n\nHave you thoughts on engaging your users? Are you one of my users with an idea, or some feedback? Do get in touch. Just use the comments section below.\n"}},"__N_SSG":true}