{"pageProps":{"post":{"title":"I'm pushing an Irish App a Week","date":"2009-04-29","content":"\nThere's lots of great app review sites out there. Some are very popular, and getting a mention can really help your iPhone App sales. But getting on them can be difficult, and I've even heard stories of how these sites are asking for payment to be featured. This may be how the world works, but I think this should at least be made explicit. Otherwise, the review or blog entry isn't quite as it seems. Is it?\n\nBut, there's a bunch of talented Irish iPhone developers who have released their own titles. Most of them hang out on [XCake.org](http://www.xcake.org/) which is a user group for iPhone developers in Ireland, both North and South.\n\nI'm gonna mention one such app per week in the hope that these apps may hit a wider audience than they already have. It will showcase some of the great work being done by Irish developers.\n\nThis week's push is [Pocket Universe](http://itunes.apple.com/WebObjects/MZStore.woa/wa/viewSoftware?id=306916838&mt=8) (App Store Link). From Dublin based [Craic Design](http://www.craicdesign.com/).\n\nRight, I gotta admit, I'm not a astronomy guy. I tend not to stargaze, but given I knew this was an Irish App, I decided to give it a whirl, and was pleasantly surprised by this app. This has genuinely one of the most innovative uses for the accelerometer and GPS I've seen.\n\nFrom the off, it decides where you are using the GPS, and maps the sky as it is, where you are right now. Handy - A wysiwyg view of the sky so to speak. But, here's where it gets cool; tilt your iPhone upwards towards the sky, and the viewport moves accordingly, so that what you are looking at in the sky is what you are seeing on your phone. A cool feature - And great for showing the kids.\n\nOf course, you may want to look at the sky from a different perspective, or from a different time of day (yes...the sky is more interesting by night!). It can do this too. Simply jump to a another place and time at the tap of a button, and it takes you there (and then!). Zooming in and out is supported through the now familiar pinch movements. Nice.\n\nAll in all, a great little educational app - If you're into astronomy, definitely take a look at this app. If you're not, its worth a look for its tilting functionality alone!\n","categories":["irishapps"],"tags":["apppush"]}},"__N_SSG":true}