{"pageProps":{"post":{"title":"No. HTML5 is NOT the Answer","date":"2011-12-14","content":"\nThe cross platform versus native app question comes up again and again. Everyone knows where we stand on this; I truly believe that natively written apps, targeted for iOS, or Android, or Windows Phone 7, etc. produce more polished, better, more engaging apps.\n\nI've never seen a _brilliant_ app written in a cross platform way. And take a look at the apps that have grabbed recent buzz. Do you think [Path](http://path.com) or [Flipboard](http://flipboard.com) ever considered a cross platform toolkit? I think not.\n\nAnd, then I often get told that the answer is HTML5. One page rendered the same on all devices.\n\nAs Wayne was known to have said\n\n> \"Shhhhyyyeaaah\"\n\nLook. Browsers differ, implementations differ, and as a result the output differs. Web designers all over the world still shudder when people mention internet explorer 6. The hacks to get web pages working across browsers was always an issue; and we're being promised that we won't have this in HTML5.\n\nOr, as Wayne was known to have said\n\n> \"And monkeys may fly out my butt\".\n\nHow do various browsers support html elements ? Well take a look [here](http://www.quirksmode.org/m/table.html \"here\"). Wow. There's a lot of red and green in there. Even a few _sort of_s, \"_incomplete_s and _almost_.\n\nHow about CSS ? Well, lets look at [that](http://www.quirksmode.org/m/css.html \"that\"). Oooh. We have _yes_, _no_, _incomplete_ and _buggy_.\n\nWanna use some HTML5 advanced features. Sure. Go ahead. Just make sure you consult [this first](http://mobilehtml5.org/), mmmkay?\n\nI know you want basic information, and you want wide reach, using HTML5 is a solution. However the promise of \"it will work everywhere\" may not be as true as you'd like it to be.\n\nIf you want a slick app, that shows your company, brand, service whatever in its best light, do yourself a favour and stay native.\n","categories":["business"]}},"__N_SSG":true}