{"pageProps":{"post":{"title":"The problem with \"revenue share\"","date":"2009-08-21","content":"\nAs an iPhone developer for hire, I get regular approaches from people with ideas that they would like to turn into realities. I sign non-disclosure agreements and then get brought into their confidence to explain their idea.\n\nSome turn out to be better than others. Those with a broad appeal may become successes; those with a niche appeal will most likely not make much money; they possibly won't turn a profit, but one man's great idea, doesn't appeal to another so generally I try to not make an early judgement call.\n\nAt some point in the conversation we get around to ballpark figures. This is usually when I explain why we will need to go into more detail. In fact, I typically cite [my own blog post about pricing](https://tapadoo.wpengine.com/2009/how-much-to-develop-an-iphone-application/). The potential client usually sees the benefit in what I am suggesting, but 9 times out of 10, they will still want ballpark pricing. I understand this. They really want to know if I think their projects is a €500 project, a €10,000 project or a €250,000 project; They are basically asking for scale and if their budget will work.\n\nIn many cases, the potential client starts to talk about doing the project on a revenue share. The logic goes like this:\n\n1. They've put time into developing their idea; its a good one, and it is going to sell like [hot cakes](http://www.stickytoffeepudding.co.uk/index.asp)\n2. All that needs to be done is to knock the code together, get it on the app store, and await for the money to start rolling in\n\n\\[caption id=\"attachment\\_199\" align=\"alignnone\" width=\"240\"\\]![Moneymoneymoney](images/3366720659_b746789dfd_m.jpg \"3366720659_b746789dfd_m\") Picture Credit: Flickr User amagill\\[/caption\\]\n\nThere's a big problem with this approach. It ignores one large part of the problem.\n\n> **Risk**\n\nIf we work together on _your idea_, I've to put a great deal of effort into the software development. Software development is complex, detailed and a good programmer has very real talent, which has taken many years to hone. (I've never met a great programmer who wasn't already at it from around 12 years old). Experienced programmers know that the [devil is in the detail](http://www.contrast.ie/blog/there-are-no-small-changes/)\n\nSo lets look at the proposition from another perspective. When did your idea come to you? While lying awake trying to go asleep? Perhaps you sat at home, with a pen and paper over many nights, scribbling ideas, honing them, refining them... or\n\n> perhaps it came to you while you were sitting at your desk in work...getting paid.\n\nAnd when am I going to do the work? Well, during my working day..when other customer's should be paying me, so aren't, because I am working on your idea, but that's ok, because its gonna sell like....well..I've already explained that.\n\nSo..Imagine all goes well...and the sales do well...From day 1 we're splitting the spoils, and this has really paid off. The customer who was going to pay me has gone to a competitor, but hey...I'm doing ok out of \"very cool idea 1.0\". Version 2.0 will probably make even more anyway.\n\nOr\n\nIt hasn't sold well...I'm behind on my mortgage...The customer who was going to pay me has gone to a competitor..and he's not coming back.\n\nHow are things with you?.....Oh...this was actually just a side project...so all is well; you're still in your day job. Hey...nothing ventured, nothing gained right?\n\nEhhh.....\n\nA good idea is valuable. If there's real evidence of work being done to develop or prove the idea, that mitigates the risk. If you've crunched the numbers, even better. (If its that good, you'd be crazy to be giving chunks of the revenue away).\n\nTell you what. I've another model. Lets use some hypothethical figures. We've knocked around your idea. Its going to cost €10k to develop, and you're interested in a revenue share. Now...lets consider the risk element.\n\nHere's a deal: I'm taking all the risk, and I see the value of your idea. So how about I do it for €5k, and there's some compensation for the risk. There's two things we can do. How about the first €10k it makes goes 100% to me, and after that we go 50/50 ? Or...How about we reflect the risk in the revenue share from day 1. So...Your investment is only €5k, but the revenue split is 70% to the developer, 30% to you.\n\nStill interested?\n\n\\[caption id=\"attachment\\_203\" align=\"alignnone\" width=\"240\"\\]![Pic Credit: flickr user texaseagle](images/3335901360_d60eab54b3_m.jpg \"3335901360_d60eab54b3_m\") Pic Credit: flickr user texaseagle\\[/caption\\]\n\nHey.....where'd ya go?\n","categories":["iphone","iphonedev"]}},"__N_SSG":true}