{"pageProps":{"post":{"title":"\"They asked for a ballpark figure. You'll never guess what they got!\"","date":"2016-03-08","content":"\nPossibly the most common question we get before anyone gets into detail\n\n> can I get a ball-park figure?\n\nBut we need to really question.\n\n> Will this bring _any_ value?\n\nUsually, at this point in the conversation we've had a very broad discussion about your idea. And you're about to go for funding or grant assistance, so you need _something_ to put into the business plan.\n\nHere's the problem: Estimating software development is hard. It requires skill and time to do so. We'll need to go much further than a conversation to appreciate the detail of your idea. And because it takes time and skill, we're going to charge for that.\n\nBut you don't have the money to do that; the grant/funding will supply that.  You're essentially saying \"I'd rather put a fictional value into my business plan than commit a small spend to finding out a more reliable value\"\n\nIf you're not willing to make that initial spend, how committed are you to your idea? If you're willing to put a fictional figure into your business plan, how much do you care about that plan?\n\nWorse, if you go to more than one supplier you are comparing one fictional figure with another fictional figure.\n\nNow consider ball-park figures from a supplier's side.  I'm asked for a ball-park figure. I can:\n\n1. Point the customer at this blog post, and be thought of as unhelpful, so I'll never land this business **or**\n2. Put in a low-estimate in the hope of winning the business, with the understanding that when we all agree the estimate was too low, there's a really awkward conversation waiting in the wings **or**\n3. Pad the estimate - there's too much risk, so I need to ensure we don't lose on the project. Less chance of an awkward conversation, but a high chance of you saying \"HOW MUCH?\", and not coming back to us.\n\nAll of these are a losing position for us.\n\nLosing position for customer, losing position for the supplier.\n\nIf you want a figure, I suggest [reading this](https://tapadoo.com/sanitise-your-app-idea/), and picking your own.\n\nSo here it is:\n\n**Ball-park figures are pointless. Get over it.**\n\nStill reading? Great. If you promise you don't ask for a ballpark figure ;-) , we'd love to help you with your next app. [Do get in touch](https://tapadoo.wpengine.com/contact).\n\nImage Credit: [Florian Christoph on Flickr](https://www.flickr.com/photos/113417287@N08/)\n","postImage":"https://cdn-bhcgp.nitrocdn.com/lQsUIlYWTGkhjqgYKmLJkHSBczAwGDPM/assets/static/optimized/rev-f8d7f54/wp-content/uploads/2016/03/Ball-Park.jpg.webp"}},"__N_SSG":true}